import React from 'react';
import {Text} from 'react-native';
import {signupStyles} from '../../Styles/SigninStyle';

const Terms01 = () => {
    return (
        <Text style={signupStyles.termsText}>
            {`
제 1 장 총칙
제1조 [목적]
본 약관은 (주)챔프스터디(이하 “회사”라 합니다)가 www.Hackers.com(이하 “웹사이트”)을 통하여 제공하는 교육 정보 서비스(이하 “서비스”라 합니다)의 이용에 관한 제반 사항을 규정하는 것을 목적으로 합니다.

제2조 [정의]
① “이용자”라 함은 “웹사이트”에 접속하여 본 약관에 따라 “회사”가 제공하는 “컨텐츠” 등 “서비스”를 이용하는 “회원” 및 “비회원”을 말합니다.
② “회원”이라 함은 “웹사이트”에 접속하여 본 약관에 동의함으로써 “아이디”를 부여 받은 자로서 “회사”가 제공하는 “서비스”를 지속적으로 이용할 수 있는 자를 말합니다.
③ “비회원”이라 함은 “웹사이트”에 접속하였으나 본 약관에 동의하지 않음으로써 “아이디”를 부여 받지 못한 자를 말합니다.
④ “아이디”라 함은 회원의 식별 및 “서비스” 이용을 위하여 “회원”이 정하고 “회사”가 승인하는 문자 또는 숫자의 조합을 말합니다.
⑤ “비밀번호”라 함은 서비스 이용시, 아이디와 일치되는 회원임을 확인하고, 회원 개인정보 보호를 위하여, 회원 자신이 정한 문자 또는 숫자의 조합을 말합니다.
⑥ “신청자”라 함은 “회원” 중에서 유료 “서비스” 이용을 신청하였으나 아직 이용 승인을 받지 못한 자를 말합니다.
⑦ “컨텐츠”라 함은 “웹사이트”에서 제공하는 온라인 강의 및 기타 관련 정보를 의미함으로써, 정보통신망에서 사용되는 부호, 문자, 음성, 음향, 이미지 또는 영상 등으로 표현된 자료 또는 정보를 말합니다.
⑧ “패키지”라 함은 “회사”가 “회원”에게 할인 혜택을 부여하기 위해 여러 개의 강의를 하나로 묶어 결제할 수 있도록 한 “컨텐츠”를 말합니다.
⑨ “개인정보”라 함은 생존하는 개인에 관한 정보로서 해당 정보에 포함되어 있는 성명, 주민등록번호 등의 사항에 의하여 해당 개인을 식별할 수 있는 정보를 말합니다.
⑩ “게시물”이라 함은 “이용자”가 “웹사이트”에 게재한 글, 이미지, 각종 파일 및 링크, 각종 댓글 등의 정보를 의미합니다.

제3조 [회사 정보 등의 제공]
“회사”는 “회사”의 상호, 대표자 성명, 주소, 전화번호, 모사전송번호, 전자우편주소, 사업자등록번호, 통신판매업 신고번호, 이용 약관, 개인정보처리방침 및 개인정보보호책임자 등에 대한 정보를 이용자가 쉽게 알 수 있도록 “웹사이트”의 초기화면에 게시합니다.

제4조 [약관의 효력과 변경]
① 본 약관은 “이용자”가 약관의 내용에 동의하며 회원가입을 신청하고, “회사”가 그 신청에 대하여 승낙함으로써 효력이 발생합니다.
② 개별 서비스 계약 시 동의한 약관이 본 약관과 저촉되는 경우 개별 서비스 계약 시 동의한 약관이 우선 적용됩니다.
③ “회사”가 본 약관의 내용을 변경하는 경우 적용일자 및 변경사유를 명시하여 현행약관과 함께 “웹사이트”의 초기화면 또는 초기화면과의 연결화면을 통해 적용일자 최소 7일(이용자에게 불리하거나 중대한 사항의 변경은 30일) 이전부터 적용일자 전일까지 공지하고, 기존 “회원”들에게는 변경 될 약관, 적용일자 및 변경사유를 전자우편주소로 이메일을 발송하여 통지합니다.
④ 전 항과 같이 약관의 변경에 대하여 통지한 경우, 그 때부터 7일(이용자에게 불리하거나 중대한 사항의 변경인 경우 30일)내에 이용자가 거절의 의사를 표시하지 않으면 변경된 약관에 동의한 것으로 간주됩니다. 단, 유료 “서비스”를 이용 중인 “회원” 중 변경될 약관에 동의하지 아니하는 “회원”은 유료 “서비스” 이용이 종료될 때까지는 기존 약관이 적용됩니다.

제5조 [약관 외 준칙]
본 약관과 “웹사이트”에 명시되지 아니한 사항이 관계법령(전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 기타 관련 법령)에 규정되어 있을 경우에는 그 규정에 따릅니다.

제6조 [회원에 대한 통지]
① “회사”는 “회원”에게 알려야 할 사항이 발생하는 경우 회원가입 시 “회원”이 공개한 전자우편주소로 이메일을 보내거나 “웹사이트”에 공지란 또는 팝업창을 게시하는 방법 등으로 통지할 수 있습니다.
② 전 항과 같이 통지한 경우 그 때부터 7일 이내에 “회원”이 “회사”가 정하는 방법으로 그 통지 내용에 동의하지 않음을 표시하지 않을 경우 그 “회원”에게는 통지 내용이 도달하였고 통지 내용에 동의하였다고 간주됩니다.
③ 통지 내용에 동의하지 아니하는 “회원”은 “회사”가 정하는 방법으로 그 의사를 표시할 수 있습니다.

제 2 장 회원가입
제7조 [회원가입]
① 회원가입은 “서비스”를 이용하려는 자가 본 약관의 내용에 동의하고 회원가입 신청을 한 후 “회사”가 이러한 신청에 대하여 승낙함으로써 완료됩니다.
② 전 항의 규정에 따라 회원가입을 할 때에는 “회사”가 제공하는 “서비스”의 원활한 이용을 위해서 필요한 “개인정보”를 제공해야 합니다. 이 경우 제공되는 “개인정보”는 “회사”가 게시한 개인정보처리방침에서 확인할 수 있습니다.

제8조 [회원가입 신청]
① “회원”으로 가입하여 “서비스”를 이용하기를 희망하는 자는 “회사”가 요청하는 소정의 신규회원가입 양식에서 요구하는 사항을 기록하여 신청합니다.
② 온라인 가입신청 양식에 기재하는 사항에 실명이나 실제 정보를 입력하지 않은 자는 법적인 보호를 받을 수 없으며, “서비스” 사용의 제한을 받을 수 있습니다.

제9조 [회원가입 신청에 대한 승낙]
① 승낙은 "회사”가 회원가입 신청을 한 자에게 “아이디”, 서비스 이용개시를 통보함으로써 이루어집니다.
② “회사”는 다음 각 호 어느 하나에 해당하는 경우 회원가입 신청에 대하여 승낙하지 아니합니다.
1. 본인의 실명으로 신청하지 않은 경우
2. 다른 사람의 명의를 빌리거나 도용하여 차명으로 신청한 경우
3. 회원가입 신청서의 내용을 허위로 기재했거나 첨부한 경우
4. 관계법령에 위배되거나 사회의 안녕질서 혹은 미풍양속을 저해할 수 있는 목적으로 신청한 경우
5. “웹사이트”의 회원을 탈퇴한 후 “회사”가 정한 일정 기간이 경과되지 않은 경우
6. 기타 “회사”가 정한 회원가입 신청 요건이 미비된 경우
③ “회사”는 다음 각 호 어느 하나에 해당하는 경우에는 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.
1. 서비스 관련 설비의 용량이 부족한 경우
2. 기술상 또는 업무 수행상 지장이 있는 경우
3. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우

제10조 [만 14세 미만 아동의 회원가입에 관한 특칙]
① 만 14세 미만의 “이용자”는 “회사”의 ”웹사이트”에서 제공되는 개인정보처리방침과 본 약관을 충분히 숙지한 후, 반드시 법정대리인의 동의를 얻어 회원가입을 신청하여야 합니다.
② “회사”는 만 14세 미만의 “이용자”가 회원가입을 신청하는 경우 별도의 안내 또는 절차를 통하여 법정대리인의 동의 여부를 확인할 수 있습니다.
③ 만 14세 미만의 “이용자”는 “회사”가 법정대리인에게 전 항의 동의사실 여부를 확인 할 수 있도록 회원가입 시 법정대리인의 성명, 유무선 연락처 등을 제공하여야 합니다.
④ “회사”는 법정대리인의 동의에 대한 확인절차를 거치지 않은 만 14세 미만 “이용자”에 대하여는 회원가입을 불허 또는 취소할 수 있습니다.
⑤ 만 14세 미만 “회원”의 법정대리인은 자녀에 대한 “개인정보”의 열람, 정정, 갱신을 요구하거나 회원가입에 대한 동의를 철회할 수 있으며, 이러한 경우에 “회사”는 지체 없이 필요한 조치를 취해야 합니다. 이 때 “회사”는 법정대리인임을 입증할 수 있는 문서 등 확인서류의 제출을 요청할 수 있습니다.

제 3 장 서비스 제공 및 이용
제11조 [서비스 이용 기술 사양]
① “회사”가 제공하는 “컨텐츠” 등 서비스 이용에 필요한 기술 사양은 ”웹사이트”의 ‘자주묻는질문’에 표시합니다.
② 전 항보다 고사양이 요구되거나 컴퓨터 이외의 다른 장치로 이용이 가능한 “컨텐츠”의 경우 “회사”는 해당 “컨텐츠”의 포장 또는 “웹사이트”에 그 내용을 표시할 수 있습니다.

제12조 [서비스 이용 요금]
① 별도로 표시된 유료 “서비스”를 제외한 모든 “서비스”는 무료로 제공됩니다. 유료 또는 무료로 제공되는 “서비스”는 회사 정책에 따라 변경될 수 있습니다.
② 유료 “서비스”의 이용 요금 및 결제 방식은 해당 “서비스” 및 결제 페이지에 명시되어 있는 내용에 따릅니다.
③ “포인트”라 함은 “회사”가 “회원”에게 혜택을 주기 위해 운영하는 가상의 지불수단을 말하며, “회사”는 “포인트”에 관한 정책을 “회사” 운영 상황에 따라 변경할 수 있으며 이를 “웹사이트”에 게시합니다.

제13조 [서비스 이용 시간 및 문의]
① “서비스”는 “회사”의 업무상, 기술상 문제 등 기타 특별한 사정이 없는 한 매일 24시간 운영함을 원칙으로 합니다. 단, “회사”는 일부 “서비스”의 이용 가능 시간을 별도로 정할 수 있으며, 이 경우 “웹사이트”를 통해 공지합니다.
② “이용자”는 “서비스” 이용 중 일반 학습 상담, 동영상 재생 오류 및 기술 상담, 강의 환불 및 변경 문의 기타 “서비스” 이용과 관련하여 문의 사항이 있는 경우 “웹사이트” 고객센터를 이용하여 온라인 문의를 하거나 또는 “회사”의 고객센터로 전화 문의를 할 수 있습니다.
③ “회사”는 원활한 “서비스” 제공을 위하여 “이용자”가 전 항에 의하여 문의하는 사항을 저장녹음하여 활용할 수 있습니다.

제14조 [서비스 제공의 중지 및 제한]
① “회사”는 다음 각 호 어느 하나에 해당하는 경우 “서비스” 제공을 중지하거나 제한할 수 있습니다.
1. 서비스용 설비의 최적화를 위한 시스템 점검 또는 설비 보수로 인해 부득이한 경우
2. 분산서비스거부(DDoS) 공격 등에 의해 발생한 서비스 장애 복구를 위해 부득이한 경우
3. 기타 서비스용 설비의 장애 또는 “서비스” 이용의 폭주 등으로 “서비스” 이용에 지장이 있는 경우
4. 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
5. 국가비상사태, 천재지변에 의해 부득이한 경우
6. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우
② “회사”가 전 항에 의하여 “서비스” 제공을 중지하거나 제한하는 경우 “회사”는 이를 “웹사이트”에 공지하는 등의 방법으로 “이용자”에게 알려드립니다. 다만, “서비스” 제공 중지 또는 제한 사유에 따라 “이용자”에 대한 공지가 곤란한 경우에는 예외로 합니다.
③ “회사”의 귀책사유로 “서비스” 제공이 중지되거나 그 이용에 장애가 발생하는 경우에는 “회사”의 규정에 따라 이용이 중지되거나 장애가 발생한 시간만큼 이용 기간을 연장합니다. 다만, 천재지변 또는 이에 준하는 불가항력으로 인하여 “서비스” 제공이 중지되거나 그 이용에 장애가 발생하는 경우에는 예외로 합니다.
④ “회사”의 귀책사유로 “컨텐츠” 자체에 이용하기 어려운 하자가 있는 경우에는 “회사”의 규정에 따라 그 하자가 복구되지 못한 기간만큼 이용 기간을 연장합니다. 다만, 완전한 “컨텐츠”를 다시 제공하는 것이 불가능한 경우에는 “회사”의 규정에 따라 다른 방법으로 그에 대한 보상을 실시할 수 있습니다.

제15조 [유료 서비스 이용의 승인]
① “회사”는 “회사”에서 규정한 결제 방법을 사용하여 “신청자”가 이용 요금을 납입한 사실이 확인되면 지체 없이 그 유료 “서비스” 이용 신청을 승인합니다.
② “회사”는 다음 각 호 어느 하나에 해당하는 경우 전 항의 승인을 제한할 수 있고 그 사유가 해소될 때까지 승인을 유보할 수 있습니다.
1. 유료 “서비스” 이용 요금을 납입하지 않은 경우
2. 유료 “서비스” 신청 금액 총액과 납입 금액 총액이 일치하지 않는 경우
3. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우
③ “회사”는 전 항에 의하여 유료 “서비스” 이용 신청의 승인을 제한하거나 유보하는 경우 이를 그 “신청자”에게 알려야 합니다.

제16조 [수강 기간의 경과]
“회사”가 유료 “서비스” 이용을 승인한 후 “회원”이 수강을 시작하지 않았거나 수강 도중 정지하여 두었다 하더라도 수강 기간은 자동 진행됩니다. 단, “컨텐츠”의 포장 또는 “웹사이트”상에 별도의 내용이 기재된 “서비스”에 대해서는 기재된 내용에 따릅니다.

제17조 [청약철회 등]
① “회사”와 “컨텐츠”의 이용 계약을 체결한 “회원”은 “서비스” 이용 승인일로부터 7일 이내에 청약철회를 할 수 있습니다.
② “회사”와 “교재”의 구매 계약을 체결한 “회원”은 “교재”를 공급받은 날로부터 7일 이내에 청약철회를 할 수 있습니다.
③ 제2항의 청약철회권은 다음 각 호의 어느 하나에 해당할 경우 행사할 수 없습니다.
1. “회원”에게 책임이 있는 사유로 교재가 멸실되거나 훼손된 경우
2. “회원”의 사용 또는 일부 소비로 “교재”의 가치가 현저히 감소한 경우
3. 시간이 지나 다시 판매하기 곤란할 정도로 “교재”의 가치가 현저히 감소한 경우
4. 복제가 가능한 “교재”의 포장을 훼손한 경우
④ “회원”은 제1항, 제2항 및 제3항에도 불구하고 “컨텐츠”, “교재”의 내용이 표시∙광고의 내용과 다르거나 계약내용과 다르게 이행된 경우에는 그 “컨텐츠”, “교재”를 공급받은 날부터 3개월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회를 할 수 있습니다.
⑤ 단기간 강의 • 이벤트 강의 등 특별한 경우의 청약철회, 수강 강의의 변경 등은 본 조항과는 별도로 “컨텐츠” 포장 또는 “웹사이트”상에 표시된 조건이 적용됩니다.

제18조 [청약철회의 효과]
① “회사”는 “이용자”의 청약철회의 의사표시를 받은 날로부터 3영업일 이내(교재 등 “이용자”가 ”회사”에 반환하여야 할 재화등이 있는 경우에는 해당 재화등을 반환 받은 날로부터 3영업일 이내)에 대금 결제와 동일한 방법으로 대금을 환불합니다.
② “회사”는 반환된 컨텐츠가 일부 사용 또는 소비된 경우 그 컨텐츠의 사용 또는 소비에 의하여 “이용자”가 얻은 이익에 상당하는 금액의 범위 내에서 “이용자”에게 청구하거나 “이용자”에게 반환할 대금에서 상계할 수 있습니다.
③ ”이용자”의 사유로 인하여 청약철회를 하는 경우 재화등의 배송에 소요된 비용은 소비자가 부담합니다.

제19조 [과오금의 환불]
① “회사”는 유료 “서비스” 결제와 관련하여 과오금이 발생한 경우 대금결제와 동일한 방법으로 그 과오금을 “회원”에게 환불합니다.
② “회사”의 책임 있는 사유로 과오금이 발생한 경우 “회사”는 과오금 전액을 환급합니다. 다만, “이용자”의 책임 있는 사유로 과오금이 발생한 경우, 과오금의 환급에 소요되는 비용은 “이용자”가 부담합니다.

제20조 [해제, 해지 등]
① “회사”의 귀책사유로 더 이상 “서비스” 제공이 불가능한 경우에는 “이용자”는 그 서비스 제공을 해제 또는 해지할 수 있습니다. 이 때, “회사”는 “이용자”가 결제한 금액 중 이미 이용한 부분에 대한 금액을 제한 나머지 금액을 “이용자”에게 환불합니다.
② “회사”는 “이용자”의 계약 해제, 해지의 의사표시를 받은 날로부터 3영업일 이내(교재 등 “이용자”가 “회사”에 반환하여야 할 재화등이 있는 경우에는 해당 재화등을 반환 받은 날로부터 3영업일 이내)에 대금 결제와 동일한 방법으로 대금을 환불합니다. 다만, 동일한 방법으로 대금의 환불이 불가능할 때에는 이를 고지하고, 회원이 선택한 방법으로 환불할 수 있습니다.

제21조 [환불에 관한 사항]
① “회원”은 “웹사이트” 등을 이용하여 환불 신청을 할 수 있습니다. 다만, 필요한 경우 고객센터를 이용할 수 있습니다.
② 환불과 관련하여 본 약관에서 규정하고 있지 않은 사항은 상품 구매시 “회원”이 별도로 동의한 계약내용 또는 관련 법령에 의하여 정해진 “회사”의 환불처리기준에 의합니다.

제 4 장 당사자의 권리와 의무
제22조 [회사의 의무]
① “회사”는 지속적 안정적으로 “서비스”를 제공하기 위해 최선을 다합니다.
② “회사”는 “서비스” 이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하도록 노력합니다.
③ “회사”는 “회원”의 “개인정보”를 그 “회원”의 동의 없이 제 3자에게 누설, 배포하지 않는 것을 원칙으로 합니다. 단, 다음 각 호의 1에 해당하는 경우에는 예외로 합니다.
1. 전기통신기본법 등 법률의 규정에 의한 국가기관의 요구가 있는 경우
2. 범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우
3. 기타 관계법령이 정한 절차에 따른 요청이 있는 경우

제23조 [개인정보 보호 등]
① “회사”는 “회원”의 “개인정보” 수집 시 필요한 최소한의 정보를 수집합니다.
② “회사”는 “회원”의 “개인정보”를 수집할 때 다음 각 호의 1에 해당하는 경우를 제외하고는 그 “회원”의 동의를 받습니다.
1. 법률에 특별한 규정이 있는 경우
2. 전자거래 계약의 이행을 위하여 필요한 경우
3. “서비스” 제공에 따른 요금 정산을 위하여 필요한 경우
③ “회사”는 “회원”의 “개인정보”를 그 “회원”의 동의 없이 목적 외로 사용하거나 제3자에게 제공할 수 없습니다. 단, 다음 각 호의 1에 해당하는 경우에는 예외로 합니다.
1. 법률에 특별한 규정이 있는 경우
2. “서비스” 제공에 따른 요금 정산을 위해 필요한 경우
3. 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공되는 경우
④ “회원”은 “웹사이트”상의 개인정보관리 시스템을 통해 언제든지 본인의 “개인정보”를 열람하고 수정할 수 있습니다. 다만, “아이디”는 변경할 수 없습니다.
⑤ “회원”은 가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정해야 하며, 이를 수정하지 아니하여 발생하는 문제의 책임은 “회원”에게 있습니다.
⑥ 개인정보의 수집목적 또는 제공받은 목적을 달성하거나 이용자의 서비스 미이용기간이 1년을 초과한 경우에는 별도 분리하여 보관합니다.
⑦ 전 항의 경우라도 “회사”가 사전에 개인정보처리방침에 규정하여 “회원”의 동의를 받거나 관련 법령에 따라 일정기간 “개인정보”를 보관해야 하는 경우 “회사”는 예외적으로 일정기간 “개인정보”를 보관할 수 있습니다.
⑧ “개인정보”의 수집, 보관, 이용, 위탁 등에 관한 제반 사항은 “회사”가 게시한 개인정보처리방침에서 확인할 수 있습니다.

제24조 [회원의 아이디와 비밀번호 관리에 대한 의무]
① “아이디”와 비밀번호에 관한 모든 관리책임은 “회원”에게 있습니다.
② 자신의 “아이디”가 부정하게 사용된 경우, “회원”은 반드시 “회사”에 그 사실을 통보해야 합니다.
③ “회사”는 전항의 경우 “회원”의 개인정보보호 및 기타 서비스 부정이용행위 방지 등을 위하여 “회원”에게 비밀번호의 변경 등 필요한 조치를 요구할 수 있으며, “회원”은 “회사”의 요구가 있는 즉시 “회사”의 요청에 성실히 응해야 합니다.
④ “회사”는 “회원”이 본 조에서 정하는 의무를 성실히 이행하지 않아 발생한 불이익에 대하여 책임지지 않습니다.

제25조 [회원의 의무]
① “회원”은 “서비스”를 이용할 때 다음 각 호의 행위를 해서는 안 됩니다.
1. 동일인이 중복하여 회원가입을 하는 경우
2. 다른 “회원”의 “아이디”를 부정하게 사용하는 행위
3. 자신의 “아이디” 및 “서비스”를 타인이 사용하도록 하는 행위
4. “서비스” 이용 시 영상, 사진, 텍스트, 음성 등의 정보를 녹화나 캡쳐 또는 녹음할 수 있는 소프트웨어를 실행시키는 행위
5. “서비스”에서 얻은 정보를 “회사”의 사전 승낙 없이 복제하거나 이를 출판 및 방송 등에 사용하거나 제 3자에게 제공하는 행위
6. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해하려는 행위
7. 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등을 타인에게 유포하는 행위
8. 범죄와 결부된다고 객관적으로 판단되는 행위
9. “회원”이 다른 “이용자”의 서비스 이용을 방해하거나, “회사”의 서비스 운영을 고의 또는 과실로 방해하는 행위
10. 회사 및 타인의 명예를 훼손하거나 모욕하는 행위
11. “회원”이 “회사”에서 제공하는 서비스를 이용하여 상품 또는 용역 등을 판매하는 상행위
12. 기타 관계법령에 위배되는 행위
② “회원”은 본 약관에 규정하는 사항과 “서비스” 이용안내 또는 주의사항을 준수해야 합니다.
③ “회원”은 사항 별로 “회사”가 “서비스” 공지사항에 게시하거나 별도로 공지한 사항을 준수해야 합니다.
④ “회원”은 “회사”의 명시적인 동의가 없는 한 “서비스”의 이용권한 기타 이용 계약상의 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다.
⑤ “회사”는 “회원”이 제1항 내지 제4항을 위반하였을 경우 사전 통지 없이 계약을 해지하거나 또는 “서비스” 이용을 제한할 수 있습니다.
⑥ “회사”가 전 항에 따라 계약을 해지하거나 “서비스” 이용을 제한하는 경우 이를 “회원”에게 알립니다. 다만, “회사”의 귀책사유 없이 “회원”에게 알릴 수 없는 경우에는 예외로 합니다.
⑦ 특히 “회원”이 다음 각 호의 1에 해당하는 행위를 하였을 경우 1회 적발 시에는 경고 또는 10일 미만의 기간 동안 “웹사이트”에 로그인 또는 “컨텐츠” 이용이 금지될 수 있으며, 2회 이상 적발 시에는 10일 이상의 기간 동안 “웹사이트”에 로그인이 금지되거나 남은 강의에 대한 수강권 또는 경우에 따라서는 “회원” 자격까지 박탈될 수 있습니다.
1. “회원”이 로그인하여 강의를 수강하고 있는 도중에 다른 아이피에서 같은 “아이디”로 로그인하여 수강하는 일이 발생하는 경우
2. “회원”이 로그아웃 후 일정 시간 경과 후 다른 지역의 아이피에서 다시 로그인하였는데, 그 일정 시간 동안 원래의 로그인 지역에서 다른 지역으로의 이동이 합리적으로 불가능하다 판단되는 경우
⑧ 특히 “회원”이 동조 제1항 제4호의 소프트웨어를 사용하며 강의를 수강하는 경우 1회 적발 시에는 경고 또는 30일 미만의 기간 동안 로그인이 금지될 수 있으며, 2회 이상 적발 시에는 30일 이상의 기간 동안 로그인이 금지되거나, 남은 강의에 대한 수강권 또는 경우에 따라서는 “회원” 자격까지 박탈될 수 있습니다.
⑨ 전 2항의 경우 로그인이 금지되는 기간 동안에도 해당 강의의 수강기간은 그대로 경과됩니다.
⑩ 중복 가입된 계정으로 회사가 제공하는 혜택을 중복수령하는 경우, 혜택을 받지 못하며 이미 제공받은 혜택은 회사에 반환하여야 합니다.

제26조 [게시물]
① “회사”는 “게시물”이 다음 각 호의 1에 해당된다고 판단되는 경우에는 그 “이용자”의 동의 없이 그 “게시물”을 삭제할 수 있습니다.
1. 다른 “이용자” 또는 제 3자를 비방하거나 중상 모략함으로써 타인의 명예를 훼손시킨 경우
2. 허위 내용이 포함되어 있거나 공공질서 및 미풍양속에 위반되는 경우
3. 범죄적 행위에 결부된다고 인정되는 경우
4. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해할 우려가 있는 경우
5. 기타 관계 법령이나 “회사”가 정한 규정에 위배되는 경우
② “회사”가 운영하는 “게시판” 등에 게시된 정보로 인하여 법률상 이익이 침해된 자는 권리 침해 사실을 소명하여 “회사”에게 당해 정보의 삭제를 요청할 수 있습니다. 이 경우 “회사”는 신속히 필요한 조치를 취하고 이를 요청자에게 통지합니다.

제 5 장 회원 탈퇴 및 자격 상실
제27조 [회원 탈퇴]
① “회원”이 “웹사이트”의 회원 탈퇴를 하고자 하는 경우에는 “회원” 본인 또는 “회원”의 법정대리인이 “회사”에 회원 탈퇴의 신청을 하여야 합니다.
② “회원”의 회원 탈퇴 신청을 확인한 경우 “회사”는 신속히 회원 탈퇴 절차를 처리하며, 관련법 및 “웹사이트”의 개인정보처리방침에 따라 “회사”가 회원정보를 보유하는 경우를 제외하고는 탈퇴 완료 후 지체 없이 “회원”의 개인정보를 파기합니다.
③ 본 조항에 따른 해지 시 회원은 이용계약 종료(회원 탈퇴) 이전에 잔여 포인트, 할인 쿠폰을 모두 사용하여야 하며, 이용계약이 종료됨과 함께 잔여 포인트, 할인 쿠폰 및 수강중인 “컨텐츠” 등 보유하고 있는 권리는 소멸됩니다.

제28조 [회원 자격 상실 및 정지]
① “회사”는 “회원”이 다음 각 호의 1에 해당하는 행위를 하였을 경우 사전 통지 없이 “회원” 자격을 상실시키거나 “회원” 자격을 정지시킬 수 있습니다.
1. 타인의 “개인정보”, “아이디” 및 비밀번호를 도용한 경우
2. 가입한 이름이 실명이 아닌 경우
3. 같은 “이용자”가 다른 “아이디”로 이중 등록을 한 경우
4. 타인의 명예를 손상시키거나 불이익을 주는 행위를 하는 경우
5. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해하려는 행위를 한 경우
6. 공공질서 및 미풍양속에 저해되는 내용을 유포시키는 경우
7. “회원”이 국익 또는 사회적 공익을 저해할 목적으로 “서비스” 이용을 계획 또는 실행하는 경우
8. “서비스” 운영을 고의 또는 과실로 방해하는 경우
9. “서비스”의 안정적 운영을 방해할 목적으로 다량의 정보를 전송하거나 광고성 정보를 전송하는 경우
10. 정보통신설비의 오작동이나 정보의 파괴를 유발시키는 컴퓨터 바이러스 프로그램 등을 유포하는 경우
11. 정보통신윤리위원회 등 외부기관의 시정 요구가 있거나 불법선거운동과 관련하여 선거관리위원회의 유권해석을 받은 경우
12. “회사”의 “서비스”를 이용하여 얻은 정보를 “회사”의 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 경우
13. “웹사이트”에 음란물을 게재하거나 음란 사이트를 링크하는 경우
14. 본 약관 기타 “회사”가 정한 의무 기타 이용 조건을 위반하는 경우
15. “회사”의 명시적인 동의 없이 “회사”가 제공하는 “서비스”를 녹화, 녹음, 캡쳐하거나 하려는 경우
16. “서비스”를 이용하는 동안 제25조 제1항 제4호의 소프트웨어를 사용하거나 사용하려고 시도한 경우
17. “회사”의 명시적인 동의 없이 “서비스”의 이용권한 기타 이용 계약상의 지위를 타인에게 양도, 증여, 담보 제공, 이용 허락 하거나 타인과 공유하는 경우
② “회사”가 전 항에 따라 “회원” 자격을 상실시키거나 제한하는 경우에는 “회사”는 이를 “회원”에게 알립니다. 다만, “회사”의 귀책사유 없이 “회원”에게 알릴 수 없는 경우에는 예외로 합니다.
③ “회사”가 제1항에 따라 “회원” 자격을 상실시키거나 제한하는 경우 해당 “회원”에 대하여는 “회사”가 제공하는 모든 “서비스”의 이용을 중단시킬 수 있고, 해당 “회원”은 “회사”에 대하여 중단 이후의 “서비스”에 대한 환불 등을 요구할 수 없습니다.

제 6 장 기타

제29조 [저작권]
① “회사”가 자체 제작한 “컨텐츠”와 “회사”가 제3자로부터 저작권을 양수 받은 “컨텐츠”에 대한 저작권은 “회사”에게 있습니다.
② “회사”가 제3자로부터 이용 허락을 받은 “컨텐츠”에 대한 저작권은 제3자에게 있고 “회사”는 그에 대한 사용권을 가집니다.
③ “회원”은 “회사”가 제공하는 “서비스”를 이용함으로써 얻은 정보를 “회사”의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리, 비영리의 목적으로 이용하거나 제 3자에게 이용하게 할 수 없습니다.
④ “회사”는 “회사” 또는 제3자의 저작권을 보호하기 위하여 “회원”이 “서비스”를 이용하는 동안 “회원”의 컴퓨터에 제25조 제1항 제4호의 소프트웨어가 실행되는 것을 감지하여 자동으로 차단하는 프로그램을 사용할 수 있습니다.
⑤ “회원”의 “게시물”에 대한 권리 및 책임은 이를 게시한 “회원”에게 있습니다.
⑥ “회사”는 “회원”이 “웹사이트”에 게시한 수강후기 등의 “게시물”을 사용, 복제, 전송, 수정, 출판, 배포할 수 있다. 단, “회원”의 “게시물”을 마케팅 등에 활용하는 경우 별도의 동의를 받지 않는 한 “회원”의 개인정보를 비식별화 조치하여 활용합니다.

제30조 [손해배상]
회원이 본 약관의 규정을 위반하여 회사 또는 제 3자에게 손해가 발생하게 되는 경우, 약관을 위반한 회원은 회사 및 제 3자에게 발생한 손해를 배상할 책임이 있습니다.

제31조 [면책조항]
① “회사”는 천재지변 또는 이에 준하는 불가항력으로 인하여 “서비스”를 제공할 수 없는 경우에는 “서비스” 제공에 관한 책임이 면제됩니다.
② “회사”는 “회원”의 사유로 인한 “서비스” 이용의 장애에 대하여 책임을 지지 않습니다.
③ “회사”는 “이용자”가 “웹사이트”에 게재한 사실의 신뢰도, 정보나 자료의 정확성 등 내용에 관하여는 책임을 지지 않습니다.
④ “회사”는 “서비스” 이용과 관련하여 “이용자”에게 발생한 손해 가운데 “이용자”의 사유에 의한 손해에 대하여 책임을 지지 않습니다.

제32조 [분쟁의 해결]

① “회사”는 “이용자”가 제기하는 의견이나 불만에 대하여 신속하게 처리하여야 합니다.
② “회사”와 “이용자” 사이에 분쟁이 발생한 경우 “회사” 또는 “이용자”는 콘텐츠분쟁조정위원회에 분쟁조정을 신청할 수 있습니다.

제33조 [학원 강의의 온라인 수강신청 등]
① “회원”의 학원 강의 온라인 수강신청, 결제, 취소, 반 변경, 환불 기타 오프라인 학원 수강과 관련된 사항은 온라인 수강신청 시 제공되는 수강접수 약관 및 관련 법령의 내용에 따릅니다.
② 단기간 강의, 이벤트 강의 등 특별한 학원 강의의 이용 등에 관한 경우에는 수강접수 약관 외에 별도의 규정이 적용될 수 있습니다.

[부칙]
본 약관은 2017년 11월 28일부터 시행됩니다.`}
</Text>);
};

const Terms02 = () => {
    return (
        <Text style={signupStyles.termsText}>
            {`
제 1 장 총칙
제1조 [목적]
본 약관은 (주)챔프스터디(이하 “회사”라 합니다)가 www.Hackers.com(이하 “웹사이트”)을 통하여 제공하는 교육 정보 서비스(이하 “서비스”라 합니다)의 이용에 관한 제반 사항을 규정하는 것을 목적으로 합니다.

제2조 [정의]
① “이용자”라 함은 “웹사이트”에 접속하여 본 약관에 따라 “회사”가 제공하는 “컨텐츠” 등 “서비스”를 이용하는 “회원” 및 “비회원”을 말합니다.
② “회원”이라 함은 “웹사이트”에 접속하여 본 약관에 동의함으로써 “아이디”를 부여 받은 자로서 “회사”가 제공하는 “서비스”를 지속적으로 이용할 수 있는 자를 말합니다.
③ “비회원”이라 함은 “웹사이트”에 접속하였으나 본 약관에 동의하지 않음으로써 “아이디”를 부여 받지 못한 자를 말합니다.
④ “아이디”라 함은 회원의 식별 및 “서비스” 이용을 위하여 “회원”이 정하고 “회사”가 승인하는 문자 또는 숫자의 조합을 말합니다.
⑤ “비밀번호”라 함은 서비스 이용시, 아이디와 일치되는 회원임을 확인하고, 회원 개인정보 보호를 위하여, 회원 자신이 정한 문자 또는 숫자의 조합을 말합니다.
⑥ “신청자”라 함은 “회원” 중에서 유료 “서비스” 이용을 신청하였으나 아직 이용 승인을 받지 못한 자를 말합니다.
⑦ “컨텐츠”라 함은 “웹사이트”에서 제공하는 온라인 강의 및 기타 관련 정보를 의미함으로써, 정보통신망에서 사용되는 부호, 문자, 음성, 음향, 이미지 또는 영상 등으로 표현된 자료 또는 정보를 말합니다.
⑧ “패키지”라 함은 “회사”가 “회원”에게 할인 혜택을 부여하기 위해 여러 개의 강의를 하나로 묶어 결제할 수 있도록 한 “컨텐츠”를 말합니다.
⑨ “개인정보”라 함은 생존하는 개인에 관한 정보로서 해당 정보에 포함되어 있는 성명, 주민등록번호 등의 사항에 의하여 해당 개인을 식별할 수 있는 정보를 말합니다.
⑩ “게시물”이라 함은 “이용자”가 “웹사이트”에 게재한 글, 이미지, 각종 파일 및 링크, 각종 댓글 등의 정보를 의미합니다.

제3조 [회사 정보 등의 제공]
“회사”는 “회사”의 상호, 대표자 성명, 주소, 전화번호, 모사전송번호, 전자우편주소, 사업자등록번호, 통신판매업 신고번호, 이용 약관, 개인정보처리방침 및 개인정보보호책임자 등에 대한 정보를 이용자가 쉽게 알 수 있도록 “웹사이트”의 초기화면에 게시합니다.

제4조 [약관의 효력과 변경]
① 본 약관은 “이용자”가 약관의 내용에 동의하며 회원가입을 신청하고, “회사”가 그 신청에 대하여 승낙함으로써 효력이 발생합니다.
② 개별 서비스 계약 시 동의한 약관이 본 약관과 저촉되는 경우 개별 서비스 계약 시 동의한 약관이 우선 적용됩니다.
③ “회사”가 본 약관의 내용을 변경하는 경우 적용일자 및 변경사유를 명시하여 현행약관과 함께 “웹사이트”의 초기화면 또는 초기화면과의 연결화면을 통해 적용일자 최소 7일(이용자에게 불리하거나 중대한 사항의 변경은 30일) 이전부터 적용일자 전일까지 공지하고, 기존 “회원”들에게는 변경 될 약관, 적용일자 및 변경사유를 전자우편주소로 이메일을 발송하여 통지합니다.
④ 전 항과 같이 약관의 변경에 대하여 통지한 경우, 그 때부터 7일(이용자에게 불리하거나 중대한 사항의 변경인 경우 30일)내에 이용자가 거절의 의사를 표시하지 않으면 변경된 약관에 동의한 것으로 간주됩니다. 단, 유료 “서비스”를 이용 중인 “회원” 중 변경될 약관에 동의하지 아니하는 “회원”은 유료 “서비스” 이용이 종료될 때까지는 기존 약관이 적용됩니다.

제5조 [약관 외 준칙]
본 약관과 “웹사이트”에 명시되지 아니한 사항이 관계법령(전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 기타 관련 법령)에 규정되어 있을 경우에는 그 규정에 따릅니다.

제6조 [회원에 대한 통지]
① “회사”는 “회원”에게 알려야 할 사항이 발생하는 경우 회원가입 시 “회원”이 공개한 전자우편주소로 이메일을 보내거나 “웹사이트”에 공지란 또는 팝업창을 게시하는 방법 등으로 통지할 수 있습니다.
② 전 항과 같이 통지한 경우 그 때부터 7일 이내에 “회원”이 “회사”가 정하는 방법으로 그 통지 내용에 동의하지 않음을 표시하지 않을 경우 그 “회원”에게는 통지 내용이 도달하였고 통지 내용에 동의하였다고 간주됩니다.
③ 통지 내용에 동의하지 아니하는 “회원”은 “회사”가 정하는 방법으로 그 의사를 표시할 수 있습니다.

제 2 장 회원가입
제7조 [회원가입]
① 회원가입은 “서비스”를 이용하려는 자가 본 약관의 내용에 동의하고 회원가입 신청을 한 후 “회사”가 이러한 신청에 대하여 승낙함으로써 완료됩니다.
② 전 항의 규정에 따라 회원가입을 할 때에는 “회사”가 제공하는 “서비스”의 원활한 이용을 위해서 필요한 “개인정보”를 제공해야 합니다. 이 경우 제공되는 “개인정보”는 “회사”가 게시한 개인정보처리방침에서 확인할 수 있습니다.

제8조 [회원가입 신청]
① “회원”으로 가입하여 “서비스”를 이용하기를 희망하는 자는 “회사”가 요청하는 소정의 신규회원가입 양식에서 요구하는 사항을 기록하여 신청합니다.
② 온라인 가입신청 양식에 기재하는 사항에 실명이나 실제 정보를 입력하지 않은 자는 법적인 보호를 받을 수 없으며, “서비스” 사용의 제한을 받을 수 있습니다.

제9조 [회원가입 신청에 대한 승낙]
① 승낙은 "회사”가 회원가입 신청을 한 자에게 “아이디”, 서비스 이용개시를 통보함으로써 이루어집니다.
② “회사”는 다음 각 호 어느 하나에 해당하는 경우 회원가입 신청에 대하여 승낙하지 아니합니다.
1. 본인의 실명으로 신청하지 않은 경우
2. 다른 사람의 명의를 빌리거나 도용하여 차명으로 신청한 경우
3. 회원가입 신청서의 내용을 허위로 기재했거나 첨부한 경우
4. 관계법령에 위배되거나 사회의 안녕질서 혹은 미풍양속을 저해할 수 있는 목적으로 신청한 경우
5. “웹사이트”의 회원을 탈퇴한 후 “회사”가 정한 일정 기간이 경과되지 않은 경우
6. 기타 “회사”가 정한 회원가입 신청 요건이 미비된 경우
③ “회사”는 다음 각 호 어느 하나에 해당하는 경우에는 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.
1. 서비스 관련 설비의 용량이 부족한 경우
2. 기술상 또는 업무 수행상 지장이 있는 경우
3. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우

제10조 [만 14세 미만 아동의 회원가입에 관한 특칙]
① 만 14세 미만의 “이용자”는 “회사”의 ”웹사이트”에서 제공되는 개인정보처리방침과 본 약관을 충분히 숙지한 후, 반드시 법정대리인의 동의를 얻어 회원가입을 신청하여야 합니다.
② “회사”는 만 14세 미만의 “이용자”가 회원가입을 신청하는 경우 별도의 안내 또는 절차를 통하여 법정대리인의 동의 여부를 확인할 수 있습니다.
③ 만 14세 미만의 “이용자”는 “회사”가 법정대리인에게 전 항의 동의사실 여부를 확인 할 수 있도록 회원가입 시 법정대리인의 성명, 유무선 연락처 등을 제공하여야 합니다.
④ “회사”는 법정대리인의 동의에 대한 확인절차를 거치지 않은 만 14세 미만 “이용자”에 대하여는 회원가입을 불허 또는 취소할 수 있습니다.
⑤ 만 14세 미만 “회원”의 법정대리인은 자녀에 대한 “개인정보”의 열람, 정정, 갱신을 요구하거나 회원가입에 대한 동의를 철회할 수 있으며, 이러한 경우에 “회사”는 지체 없이 필요한 조치를 취해야 합니다. 이 때 “회사”는 법정대리인임을 입증할 수 있는 문서 등 확인서류의 제출을 요청할 수 있습니다.

제 3 장 서비스 제공 및 이용
제11조 [서비스 이용 기술 사양]
① “회사”가 제공하는 “컨텐츠” 등 서비스 이용에 필요한 기술 사양은 ”웹사이트”의 ‘자주묻는질문’에 표시합니다.
② 전 항보다 고사양이 요구되거나 컴퓨터 이외의 다른 장치로 이용이 가능한 “컨텐츠”의 경우 “회사”는 해당 “컨텐츠”의 포장 또는 “웹사이트”에 그 내용을 표시할 수 있습니다.

제12조 [서비스 이용 요금]
① 별도로 표시된 유료 “서비스”를 제외한 모든 “서비스”는 무료로 제공됩니다. 유료 또는 무료로 제공되는 “서비스”는 회사 정책에 따라 변경될 수 있습니다.
② 유료 “서비스”의 이용 요금 및 결제 방식은 해당 “서비스” 및 결제 페이지에 명시되어 있는 내용에 따릅니다.
③ “포인트”라 함은 “회사”가 “회원”에게 혜택을 주기 위해 운영하는 가상의 지불수단을 말하며, “회사”는 “포인트”에 관한 정책을 “회사” 운영 상황에 따라 변경할 수 있으며 이를 “웹사이트”에 게시합니다.

제13조 [서비스 이용 시간 및 문의]
① “서비스”는 “회사”의 업무상, 기술상 문제 등 기타 특별한 사정이 없는 한 매일 24시간 운영함을 원칙으로 합니다. 단, “회사”는 일부 “서비스”의 이용 가능 시간을 별도로 정할 수 있으며, 이 경우 “웹사이트”를 통해 공지합니다.
② “이용자”는 “서비스” 이용 중 일반 학습 상담, 동영상 재생 오류 및 기술 상담, 강의 환불 및 변경 문의 기타 “서비스” 이용과 관련하여 문의 사항이 있는 경우 “웹사이트” 고객센터를 이용하여 온라인 문의를 하거나 또는 “회사”의 고객센터로 전화 문의를 할 수 있습니다.
③ “회사”는 원활한 “서비스” 제공을 위하여 “이용자”가 전 항에 의하여 문의하는 사항을 저장녹음하여 활용할 수 있습니다.

제14조 [서비스 제공의 중지 및 제한]
① “회사”는 다음 각 호 어느 하나에 해당하는 경우 “서비스” 제공을 중지하거나 제한할 수 있습니다.
1. 서비스용 설비의 최적화를 위한 시스템 점검 또는 설비 보수로 인해 부득이한 경우
2. 분산서비스거부(DDoS) 공격 등에 의해 발생한 서비스 장애 복구를 위해 부득이한 경우
3. 기타 서비스용 설비의 장애 또는 “서비스” 이용의 폭주 등으로 “서비스” 이용에 지장이 있는 경우
4. 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
5. 국가비상사태, 천재지변에 의해 부득이한 경우
6. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우
② “회사”가 전 항에 의하여 “서비스” 제공을 중지하거나 제한하는 경우 “회사”는 이를 “웹사이트”에 공지하는 등의 방법으로 “이용자”에게 알려드립니다. 다만, “서비스” 제공 중지 또는 제한 사유에 따라 “이용자”에 대한 공지가 곤란한 경우에는 예외로 합니다.
③ “회사”의 귀책사유로 “서비스” 제공이 중지되거나 그 이용에 장애가 발생하는 경우에는 “회사”의 규정에 따라 이용이 중지되거나 장애가 발생한 시간만큼 이용 기간을 연장합니다. 다만, 천재지변 또는 이에 준하는 불가항력으로 인하여 “서비스” 제공이 중지되거나 그 이용에 장애가 발생하는 경우에는 예외로 합니다.
④ “회사”의 귀책사유로 “컨텐츠” 자체에 이용하기 어려운 하자가 있는 경우에는 “회사”의 규정에 따라 그 하자가 복구되지 못한 기간만큼 이용 기간을 연장합니다. 다만, 완전한 “컨텐츠”를 다시 제공하는 것이 불가능한 경우에는 “회사”의 규정에 따라 다른 방법으로 그에 대한 보상을 실시할 수 있습니다.

제15조 [유료 서비스 이용의 승인]
① “회사”는 “회사”에서 규정한 결제 방법을 사용하여 “신청자”가 이용 요금을 납입한 사실이 확인되면 지체 없이 그 유료 “서비스” 이용 신청을 승인합니다.
② “회사”는 다음 각 호 어느 하나에 해당하는 경우 전 항의 승인을 제한할 수 있고 그 사유가 해소될 때까지 승인을 유보할 수 있습니다.
1. 유료 “서비스” 이용 요금을 납입하지 않은 경우
2. 유료 “서비스” 신청 금액 총액과 납입 금액 총액이 일치하지 않는 경우
3. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우
③ “회사”는 전 항에 의하여 유료 “서비스” 이용 신청의 승인을 제한하거나 유보하는 경우 이를 그 “신청자”에게 알려야 합니다.

제16조 [수강 기간의 경과]
“회사”가 유료 “서비스” 이용을 승인한 후 “회원”이 수강을 시작하지 않았거나 수강 도중 정지하여 두었다 하더라도 수강 기간은 자동 진행됩니다. 단, “컨텐츠”의 포장 또는 “웹사이트”상에 별도의 내용이 기재된 “서비스”에 대해서는 기재된 내용에 따릅니다.

제17조 [청약철회 등]
① “회사”와 “컨텐츠”의 이용 계약을 체결한 “회원”은 “서비스” 이용 승인일로부터 7일 이내에 청약철회를 할 수 있습니다.
② “회사”와 “교재”의 구매 계약을 체결한 “회원”은 “교재”를 공급받은 날로부터 7일 이내에 청약철회를 할 수 있습니다.
③ 제2항의 청약철회권은 다음 각 호의 어느 하나에 해당할 경우 행사할 수 없습니다.
1. “회원”에게 책임이 있는 사유로 교재가 멸실되거나 훼손된 경우
2. “회원”의 사용 또는 일부 소비로 “교재”의 가치가 현저히 감소한 경우
3. 시간이 지나 다시 판매하기 곤란할 정도로 “교재”의 가치가 현저히 감소한 경우
4. 복제가 가능한 “교재”의 포장을 훼손한 경우
④ “회원”은 제1항, 제2항 및 제3항에도 불구하고 “컨텐츠”, “교재”의 내용이 표시∙광고의 내용과 다르거나 계약내용과 다르게 이행된 경우에는 그 “컨텐츠”, “교재”를 공급받은 날부터 3개월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회를 할 수 있습니다.
⑤ 단기간 강의 • 이벤트 강의 등 특별한 경우의 청약철회, 수강 강의의 변경 등은 본 조항과는 별도로 “컨텐츠” 포장 또는 “웹사이트”상에 표시된 조건이 적용됩니다.

제18조 [청약철회의 효과]
① “회사”는 “이용자”의 청약철회의 의사표시를 받은 날로부터 3영업일 이내(교재 등 “이용자”가 ”회사”에 반환하여야 할 재화등이 있는 경우에는 해당 재화등을 반환 받은 날로부터 3영업일 이내)에 대금 결제와 동일한 방법으로 대금을 환불합니다.
② “회사”는 반환된 컨텐츠가 일부 사용 또는 소비된 경우 그 컨텐츠의 사용 또는 소비에 의하여 “이용자”가 얻은 이익에 상당하는 금액의 범위 내에서 “이용자”에게 청구하거나 “이용자”에게 반환할 대금에서 상계할 수 있습니다.
③ ”이용자”의 사유로 인하여 청약철회를 하는 경우 재화등의 배송에 소요된 비용은 소비자가 부담합니다.

제19조 [과오금의 환불]
① “회사”는 유료 “서비스” 결제와 관련하여 과오금이 발생한 경우 대금결제와 동일한 방법으로 그 과오금을 “회원”에게 환불합니다.
② “회사”의 책임 있는 사유로 과오금이 발생한 경우 “회사”는 과오금 전액을 환급합니다. 다만, “이용자”의 책임 있는 사유로 과오금이 발생한 경우, 과오금의 환급에 소요되는 비용은 “이용자”가 부담합니다.

제20조 [해제, 해지 등]
① “회사”의 귀책사유로 더 이상 “서비스” 제공이 불가능한 경우에는 “이용자”는 그 서비스 제공을 해제 또는 해지할 수 있습니다. 이 때, “회사”는 “이용자”가 결제한 금액 중 이미 이용한 부분에 대한 금액을 제한 나머지 금액을 “이용자”에게 환불합니다.
② “회사”는 “이용자”의 계약 해제, 해지의 의사표시를 받은 날로부터 3영업일 이내(교재 등 “이용자”가 “회사”에 반환하여야 할 재화등이 있는 경우에는 해당 재화등을 반환 받은 날로부터 3영업일 이내)에 대금 결제와 동일한 방법으로 대금을 환불합니다. 다만, 동일한 방법으로 대금의 환불이 불가능할 때에는 이를 고지하고, 회원이 선택한 방법으로 환불할 수 있습니다.

제21조 [환불에 관한 사항]
① “회원”은 “웹사이트” 등을 이용하여 환불 신청을 할 수 있습니다. 다만, 필요한 경우 고객센터를 이용할 수 있습니다.
② 환불과 관련하여 본 약관에서 규정하고 있지 않은 사항은 상품 구매시 “회원”이 별도로 동의한 계약내용 또는 관련 법령에 의하여 정해진 “회사”의 환불처리기준에 의합니다.

제 4 장 당사자의 권리와 의무
제22조 [회사의 의무]
① “회사”는 지속적 안정적으로 “서비스”를 제공하기 위해 최선을 다합니다.
② “회사”는 “서비스” 이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하도록 노력합니다.
③ “회사”는 “회원”의 “개인정보”를 그 “회원”의 동의 없이 제 3자에게 누설, 배포하지 않는 것을 원칙으로 합니다. 단, 다음 각 호의 1에 해당하는 경우에는 예외로 합니다.
1. 전기통신기본법 등 법률의 규정에 의한 국가기관의 요구가 있는 경우
2. 범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우
3. 기타 관계법령이 정한 절차에 따른 요청이 있는 경우

제23조 [개인정보 보호 등]
① “회사”는 “회원”의 “개인정보” 수집 시 필요한 최소한의 정보를 수집합니다.
② “회사”는 “회원”의 “개인정보”를 수집할 때 다음 각 호의 1에 해당하는 경우를 제외하고는 그 “회원”의 동의를 받습니다.
1. 법률에 특별한 규정이 있는 경우
2. 전자거래 계약의 이행을 위하여 필요한 경우
3. “서비스” 제공에 따른 요금 정산을 위하여 필요한 경우
③ “회사”는 “회원”의 “개인정보”를 그 “회원”의 동의 없이 목적 외로 사용하거나 제3자에게 제공할 수 없습니다. 단, 다음 각 호의 1에 해당하는 경우에는 예외로 합니다.
1. 법률에 특별한 규정이 있는 경우
2. “서비스” 제공에 따른 요금 정산을 위해 필요한 경우
3. 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공되는 경우
④ “회원”은 “웹사이트”상의 개인정보관리 시스템을 통해 언제든지 본인의 “개인정보”를 열람하고 수정할 수 있습니다. 다만, “아이디”는 변경할 수 없습니다.
⑤ “회원”은 가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정해야 하며, 이를 수정하지 아니하여 발생하는 문제의 책임은 “회원”에게 있습니다.
⑥ 개인정보의 수집목적 또는 제공받은 목적을 달성하거나 이용자의 서비스 미이용기간이 1년을 초과한 경우에는 별도 분리하여 보관합니다.
⑦ 전 항의 경우라도 “회사”가 사전에 개인정보처리방침에 규정하여 “회원”의 동의를 받거나 관련 법령에 따라 일정기간 “개인정보”를 보관해야 하는 경우 “회사”는 예외적으로 일정기간 “개인정보”를 보관할 수 있습니다.
⑧ “개인정보”의 수집, 보관, 이용, 위탁 등에 관한 제반 사항은 “회사”가 게시한 개인정보처리방침에서 확인할 수 있습니다.

제24조 [회원의 아이디와 비밀번호 관리에 대한 의무]
① “아이디”와 비밀번호에 관한 모든 관리책임은 “회원”에게 있습니다.
② 자신의 “아이디”가 부정하게 사용된 경우, “회원”은 반드시 “회사”에 그 사실을 통보해야 합니다.
③ “회사”는 전항의 경우 “회원”의 개인정보보호 및 기타 서비스 부정이용행위 방지 등을 위하여 “회원”에게 비밀번호의 변경 등 필요한 조치를 요구할 수 있으며, “회원”은 “회사”의 요구가 있는 즉시 “회사”의 요청에 성실히 응해야 합니다.
④ “회사”는 “회원”이 본 조에서 정하는 의무를 성실히 이행하지 않아 발생한 불이익에 대하여 책임지지 않습니다.

제25조 [회원의 의무]
① “회원”은 “서비스”를 이용할 때 다음 각 호의 행위를 해서는 안 됩니다.
1. 동일인이 중복하여 회원가입을 하는 경우
2. 다른 “회원”의 “아이디”를 부정하게 사용하는 행위
3. 자신의 “아이디” 및 “서비스”를 타인이 사용하도록 하는 행위
4. “서비스” 이용 시 영상, 사진, 텍스트, 음성 등의 정보를 녹화나 캡쳐 또는 녹음할 수 있는 소프트웨어를 실행시키는 행위
5. “서비스”에서 얻은 정보를 “회사”의 사전 승낙 없이 복제하거나 이를 출판 및 방송 등에 사용하거나 제 3자에게 제공하는 행위
6. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해하려는 행위
7. 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등을 타인에게 유포하는 행위
8. 범죄와 결부된다고 객관적으로 판단되는 행위
9. “회원”이 다른 “이용자”의 서비스 이용을 방해하거나, “회사”의 서비스 운영을 고의 또는 과실로 방해하는 행위
10. 회사 및 타인의 명예를 훼손하거나 모욕하는 행위
11. “회원”이 “회사”에서 제공하는 서비스를 이용하여 상품 또는 용역 등을 판매하는 상행위
12. 기타 관계법령에 위배되는 행위
② “회원”은 본 약관에 규정하는 사항과 “서비스” 이용안내 또는 주의사항을 준수해야 합니다.
③ “회원”은 사항 별로 “회사”가 “서비스” 공지사항에 게시하거나 별도로 공지한 사항을 준수해야 합니다.
④ “회원”은 “회사”의 명시적인 동의가 없는 한 “서비스”의 이용권한 기타 이용 계약상의 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다.
⑤ “회사”는 “회원”이 제1항 내지 제4항을 위반하였을 경우 사전 통지 없이 계약을 해지하거나 또는 “서비스” 이용을 제한할 수 있습니다.
⑥ “회사”가 전 항에 따라 계약을 해지하거나 “서비스” 이용을 제한하는 경우 이를 “회원”에게 알립니다. 다만, “회사”의 귀책사유 없이 “회원”에게 알릴 수 없는 경우에는 예외로 합니다.
⑦ 특히 “회원”이 다음 각 호의 1에 해당하는 행위를 하였을 경우 1회 적발 시에는 경고 또는 10일 미만의 기간 동안 “웹사이트”에 로그인 또는 “컨텐츠” 이용이 금지될 수 있으며, 2회 이상 적발 시에는 10일 이상의 기간 동안 “웹사이트”에 로그인이 금지되거나 남은 강의에 대한 수강권 또는 경우에 따라서는 “회원” 자격까지 박탈될 수 있습니다.
1. “회원”이 로그인하여 강의를 수강하고 있는 도중에 다른 아이피에서 같은 “아이디”로 로그인하여 수강하는 일이 발생하는 경우
2. “회원”이 로그아웃 후 일정 시간 경과 후 다른 지역의 아이피에서 다시 로그인하였는데, 그 일정 시간 동안 원래의 로그인 지역에서 다른 지역으로의 이동이 합리적으로 불가능하다 판단되는 경우
⑧ 특히 “회원”이 동조 제1항 제4호의 소프트웨어를 사용하며 강의를 수강하는 경우 1회 적발 시에는 경고 또는 30일 미만의 기간 동안 로그인이 금지될 수 있으며, 2회 이상 적발 시에는 30일 이상의 기간 동안 로그인이 금지되거나, 남은 강의에 대한 수강권 또는 경우에 따라서는 “회원” 자격까지 박탈될 수 있습니다.
⑨ 전 2항의 경우 로그인이 금지되는 기간 동안에도 해당 강의의 수강기간은 그대로 경과됩니다.
⑩ 중복 가입된 계정으로 회사가 제공하는 혜택을 중복수령하는 경우, 혜택을 받지 못하며 이미 제공받은 혜택은 회사에 반환하여야 합니다.

제26조 [게시물]
① “회사”는 “게시물”이 다음 각 호의 1에 해당된다고 판단되는 경우에는 그 “이용자”의 동의 없이 그 “게시물”을 삭제할 수 있습니다.
1. 다른 “이용자” 또는 제 3자를 비방하거나 중상 모략함으로써 타인의 명예를 훼손시킨 경우
2. 허위 내용이 포함되어 있거나 공공질서 및 미풍양속에 위반되는 경우
3. 범죄적 행위에 결부된다고 인정되는 경우
4. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해할 우려가 있는 경우
5. 기타 관계 법령이나 “회사”가 정한 규정에 위배되는 경우
② “회사”가 운영하는 “게시판” 등에 게시된 정보로 인하여 법률상 이익이 침해된 자는 권리 침해 사실을 소명하여 “회사”에게 당해 정보의 삭제를 요청할 수 있습니다. 이 경우 “회사”는 신속히 필요한 조치를 취하고 이를 요청자에게 통지합니다.

제 5 장 회원 탈퇴 및 자격 상실
제27조 [회원 탈퇴]
① “회원”이 “웹사이트”의 회원 탈퇴를 하고자 하는 경우에는 “회원” 본인 또는 “회원”의 법정대리인이 “회사”에 회원 탈퇴의 신청을 하여야 합니다.
② “회원”의 회원 탈퇴 신청을 확인한 경우 “회사”는 신속히 회원 탈퇴 절차를 처리하며, 관련법 및 “웹사이트”의 개인정보처리방침에 따라 “회사”가 회원정보를 보유하는 경우를 제외하고는 탈퇴 완료 후 지체 없이 “회원”의 개인정보를 파기합니다.
③ 본 조항에 따른 해지 시 회원은 이용계약 종료(회원 탈퇴) 이전에 잔여 포인트, 할인 쿠폰을 모두 사용하여야 하며, 이용계약이 종료됨과 함께 잔여 포인트, 할인 쿠폰 및 수강중인 “컨텐츠” 등 보유하고 있는 권리는 소멸됩니다.

제28조 [회원 자격 상실 및 정지]
① “회사”는 “회원”이 다음 각 호의 1에 해당하는 행위를 하였을 경우 사전 통지 없이 “회원” 자격을 상실시키거나 “회원” 자격을 정지시킬 수 있습니다.
1. 타인의 “개인정보”, “아이디” 및 비밀번호를 도용한 경우
2. 가입한 이름이 실명이 아닌 경우
3. 같은 “이용자”가 다른 “아이디”로 이중 등록을 한 경우
4. 타인의 명예를 손상시키거나 불이익을 주는 행위를 하는 경우
5. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해하려는 행위를 한 경우
6. 공공질서 및 미풍양속에 저해되는 내용을 유포시키는 경우
7. “회원”이 국익 또는 사회적 공익을 저해할 목적으로 “서비스” 이용을 계획 또는 실행하는 경우
8. “서비스” 운영을 고의 또는 과실로 방해하는 경우
9. “서비스”의 안정적 운영을 방해할 목적으로 다량의 정보를 전송하거나 광고성 정보를 전송하는 경우
10. 정보통신설비의 오작동이나 정보의 파괴를 유발시키는 컴퓨터 바이러스 프로그램 등을 유포하는 경우
11. 정보통신윤리위원회 등 외부기관의 시정 요구가 있거나 불법선거운동과 관련하여 선거관리위원회의 유권해석을 받은 경우
12. “회사”의 “서비스”를 이용하여 얻은 정보를 “회사”의 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 경우
13. “웹사이트”에 음란물을 게재하거나 음란 사이트를 링크하는 경우
14. 본 약관 기타 “회사”가 정한 의무 기타 이용 조건을 위반하는 경우
15. “회사”의 명시적인 동의 없이 “회사”가 제공하는 “서비스”를 녹화, 녹음, 캡쳐하거나 하려는 경우
16. “서비스”를 이용하는 동안 제25조 제1항 제4호의 소프트웨어를 사용하거나 사용하려고 시도한 경우
17. “회사”의 명시적인 동의 없이 “서비스”의 이용권한 기타 이용 계약상의 지위를 타인에게 양도, 증여, 담보 제공, 이용 허락 하거나 타인과 공유하는 경우
② “회사”가 전 항에 따라 “회원” 자격을 상실시키거나 제한하는 경우에는 “회사”는 이를 “회원”에게 알립니다. 다만, “회사”의 귀책사유 없이 “회원”에게 알릴 수 없는 경우에는 예외로 합니다.
③ “회사”가 제1항에 따라 “회원” 자격을 상실시키거나 제한하는 경우 해당 “회원”에 대하여는 “회사”가 제공하는 모든 “서비스”의 이용을 중단시킬 수 있고, 해당 “회원”은 “회사”에 대하여 중단 이후의 “서비스”에 대한 환불 등을 요구할 수 없습니다.

제 6 장 기타

제29조 [저작권]
① “회사”가 자체 제작한 “컨텐츠”와 “회사”가 제3자로부터 저작권을 양수 받은 “컨텐츠”에 대한 저작권은 “회사”에게 있습니다.
② “회사”가 제3자로부터 이용 허락을 받은 “컨텐츠”에 대한 저작권은 제3자에게 있고 “회사”는 그에 대한 사용권을 가집니다.
③ “회원”은 “회사”가 제공하는 “서비스”를 이용함으로써 얻은 정보를 “회사”의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리, 비영리의 목적으로 이용하거나 제 3자에게 이용하게 할 수 없습니다.
④ “회사”는 “회사” 또는 제3자의 저작권을 보호하기 위하여 “회원”이 “서비스”를 이용하는 동안 “회원”의 컴퓨터에 제25조 제1항 제4호의 소프트웨어가 실행되는 것을 감지하여 자동으로 차단하는 프로그램을 사용할 수 있습니다.
⑤ “회원”의 “게시물”에 대한 권리 및 책임은 이를 게시한 “회원”에게 있습니다.
⑥ “회사”는 “회원”이 “웹사이트”에 게시한 수강후기 등의 “게시물”을 사용, 복제, 전송, 수정, 출판, 배포할 수 있다. 단, “회원”의 “게시물”을 마케팅 등에 활용하는 경우 별도의 동의를 받지 않는 한 “회원”의 개인정보를 비식별화 조치하여 활용합니다.

제30조 [손해배상]
회원이 본 약관의 규정을 위반하여 회사 또는 제 3자에게 손해가 발생하게 되는 경우, 약관을 위반한 회원은 회사 및 제 3자에게 발생한 손해를 배상할 책임이 있습니다.

제31조 [면책조항]
① “회사”는 천재지변 또는 이에 준하는 불가항력으로 인하여 “서비스”를 제공할 수 없는 경우에는 “서비스” 제공에 관한 책임이 면제됩니다.
② “회사”는 “회원”의 사유로 인한 “서비스” 이용의 장애에 대하여 책임을 지지 않습니다.
③ “회사”는 “이용자”가 “웹사이트”에 게재한 사실의 신뢰도, 정보나 자료의 정확성 등 내용에 관하여는 책임을 지지 않습니다.
④ “회사”는 “서비스” 이용과 관련하여 “이용자”에게 발생한 손해 가운데 “이용자”의 사유에 의한 손해에 대하여 책임을 지지 않습니다.

제32조 [분쟁의 해결]

① “회사”는 “이용자”가 제기하는 의견이나 불만에 대하여 신속하게 처리하여야 합니다.
② “회사”와 “이용자” 사이에 분쟁이 발생한 경우 “회사” 또는 “이용자”는 콘텐츠분쟁조정위원회에 분쟁조정을 신청할 수 있습니다.

제33조 [학원 강의의 온라인 수강신청 등]
① “회원”의 학원 강의 온라인 수강신청, 결제, 취소, 반 변경, 환불 기타 오프라인 학원 수강과 관련된 사항은 온라인 수강신청 시 제공되는 수강접수 약관 및 관련 법령의 내용에 따릅니다.
② 단기간 강의, 이벤트 강의 등 특별한 학원 강의의 이용 등에 관한 경우에는 수강접수 약관 외에 별도의 규정이 적용될 수 있습니다.

[부칙]
본 약관은 2017년 11월 28일부터 시행됩니다.`}
</Text>);
};

const Terms03 = () => {
    return (
        <Text style={signupStyles.termsText}>
            {`
제 1 장 총칙
제1조 [목적]
본 약관은 (주)챔프스터디(이하 “회사”라 합니다)가 www.Hackers.com(이하 “웹사이트”)을 통하여 제공하는 교육 정보 서비스(이하 “서비스”라 합니다)의 이용에 관한 제반 사항을 규정하는 것을 목적으로 합니다.

제2조 [정의]
① “이용자”라 함은 “웹사이트”에 접속하여 본 약관에 따라 “회사”가 제공하는 “컨텐츠” 등 “서비스”를 이용하는 “회원” 및 “비회원”을 말합니다.
② “회원”이라 함은 “웹사이트”에 접속하여 본 약관에 동의함으로써 “아이디”를 부여 받은 자로서 “회사”가 제공하는 “서비스”를 지속적으로 이용할 수 있는 자를 말합니다.
③ “비회원”이라 함은 “웹사이트”에 접속하였으나 본 약관에 동의하지 않음으로써 “아이디”를 부여 받지 못한 자를 말합니다.
④ “아이디”라 함은 회원의 식별 및 “서비스” 이용을 위하여 “회원”이 정하고 “회사”가 승인하는 문자 또는 숫자의 조합을 말합니다.
⑤ “비밀번호”라 함은 서비스 이용시, 아이디와 일치되는 회원임을 확인하고, 회원 개인정보 보호를 위하여, 회원 자신이 정한 문자 또는 숫자의 조합을 말합니다.
⑥ “신청자”라 함은 “회원” 중에서 유료 “서비스” 이용을 신청하였으나 아직 이용 승인을 받지 못한 자를 말합니다.
⑦ “컨텐츠”라 함은 “웹사이트”에서 제공하는 온라인 강의 및 기타 관련 정보를 의미함으로써, 정보통신망에서 사용되는 부호, 문자, 음성, 음향, 이미지 또는 영상 등으로 표현된 자료 또는 정보를 말합니다.
⑧ “패키지”라 함은 “회사”가 “회원”에게 할인 혜택을 부여하기 위해 여러 개의 강의를 하나로 묶어 결제할 수 있도록 한 “컨텐츠”를 말합니다.
⑨ “개인정보”라 함은 생존하는 개인에 관한 정보로서 해당 정보에 포함되어 있는 성명, 주민등록번호 등의 사항에 의하여 해당 개인을 식별할 수 있는 정보를 말합니다.
⑩ “게시물”이라 함은 “이용자”가 “웹사이트”에 게재한 글, 이미지, 각종 파일 및 링크, 각종 댓글 등의 정보를 의미합니다.

제3조 [회사 정보 등의 제공]
“회사”는 “회사”의 상호, 대표자 성명, 주소, 전화번호, 모사전송번호, 전자우편주소, 사업자등록번호, 통신판매업 신고번호, 이용 약관, 개인정보처리방침 및 개인정보보호책임자 등에 대한 정보를 이용자가 쉽게 알 수 있도록 “웹사이트”의 초기화면에 게시합니다.

제4조 [약관의 효력과 변경]
① 본 약관은 “이용자”가 약관의 내용에 동의하며 회원가입을 신청하고, “회사”가 그 신청에 대하여 승낙함으로써 효력이 발생합니다.
② 개별 서비스 계약 시 동의한 약관이 본 약관과 저촉되는 경우 개별 서비스 계약 시 동의한 약관이 우선 적용됩니다.
③ “회사”가 본 약관의 내용을 변경하는 경우 적용일자 및 변경사유를 명시하여 현행약관과 함께 “웹사이트”의 초기화면 또는 초기화면과의 연결화면을 통해 적용일자 최소 7일(이용자에게 불리하거나 중대한 사항의 변경은 30일) 이전부터 적용일자 전일까지 공지하고, 기존 “회원”들에게는 변경 될 약관, 적용일자 및 변경사유를 전자우편주소로 이메일을 발송하여 통지합니다.
④ 전 항과 같이 약관의 변경에 대하여 통지한 경우, 그 때부터 7일(이용자에게 불리하거나 중대한 사항의 변경인 경우 30일)내에 이용자가 거절의 의사를 표시하지 않으면 변경된 약관에 동의한 것으로 간주됩니다. 단, 유료 “서비스”를 이용 중인 “회원” 중 변경될 약관에 동의하지 아니하는 “회원”은 유료 “서비스” 이용이 종료될 때까지는 기존 약관이 적용됩니다.

제5조 [약관 외 준칙]
본 약관과 “웹사이트”에 명시되지 아니한 사항이 관계법령(전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 기타 관련 법령)에 규정되어 있을 경우에는 그 규정에 따릅니다.

제6조 [회원에 대한 통지]
① “회사”는 “회원”에게 알려야 할 사항이 발생하는 경우 회원가입 시 “회원”이 공개한 전자우편주소로 이메일을 보내거나 “웹사이트”에 공지란 또는 팝업창을 게시하는 방법 등으로 통지할 수 있습니다.
② 전 항과 같이 통지한 경우 그 때부터 7일 이내에 “회원”이 “회사”가 정하는 방법으로 그 통지 내용에 동의하지 않음을 표시하지 않을 경우 그 “회원”에게는 통지 내용이 도달하였고 통지 내용에 동의하였다고 간주됩니다.
③ 통지 내용에 동의하지 아니하는 “회원”은 “회사”가 정하는 방법으로 그 의사를 표시할 수 있습니다.

제 2 장 회원가입
제7조 [회원가입]
① 회원가입은 “서비스”를 이용하려는 자가 본 약관의 내용에 동의하고 회원가입 신청을 한 후 “회사”가 이러한 신청에 대하여 승낙함으로써 완료됩니다.
② 전 항의 규정에 따라 회원가입을 할 때에는 “회사”가 제공하는 “서비스”의 원활한 이용을 위해서 필요한 “개인정보”를 제공해야 합니다. 이 경우 제공되는 “개인정보”는 “회사”가 게시한 개인정보처리방침에서 확인할 수 있습니다.

제8조 [회원가입 신청]
① “회원”으로 가입하여 “서비스”를 이용하기를 희망하는 자는 “회사”가 요청하는 소정의 신규회원가입 양식에서 요구하는 사항을 기록하여 신청합니다.
② 온라인 가입신청 양식에 기재하는 사항에 실명이나 실제 정보를 입력하지 않은 자는 법적인 보호를 받을 수 없으며, “서비스” 사용의 제한을 받을 수 있습니다.

제9조 [회원가입 신청에 대한 승낙]
① 승낙은 "회사”가 회원가입 신청을 한 자에게 “아이디”, 서비스 이용개시를 통보함으로써 이루어집니다.
② “회사”는 다음 각 호 어느 하나에 해당하는 경우 회원가입 신청에 대하여 승낙하지 아니합니다.
1. 본인의 실명으로 신청하지 않은 경우
2. 다른 사람의 명의를 빌리거나 도용하여 차명으로 신청한 경우
3. 회원가입 신청서의 내용을 허위로 기재했거나 첨부한 경우
4. 관계법령에 위배되거나 사회의 안녕질서 혹은 미풍양속을 저해할 수 있는 목적으로 신청한 경우
5. “웹사이트”의 회원을 탈퇴한 후 “회사”가 정한 일정 기간이 경과되지 않은 경우
6. 기타 “회사”가 정한 회원가입 신청 요건이 미비된 경우
③ “회사”는 다음 각 호 어느 하나에 해당하는 경우에는 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.
1. 서비스 관련 설비의 용량이 부족한 경우
2. 기술상 또는 업무 수행상 지장이 있는 경우
3. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우

제10조 [만 14세 미만 아동의 회원가입에 관한 특칙]
① 만 14세 미만의 “이용자”는 “회사”의 ”웹사이트”에서 제공되는 개인정보처리방침과 본 약관을 충분히 숙지한 후, 반드시 법정대리인의 동의를 얻어 회원가입을 신청하여야 합니다.
② “회사”는 만 14세 미만의 “이용자”가 회원가입을 신청하는 경우 별도의 안내 또는 절차를 통하여 법정대리인의 동의 여부를 확인할 수 있습니다.
③ 만 14세 미만의 “이용자”는 “회사”가 법정대리인에게 전 항의 동의사실 여부를 확인 할 수 있도록 회원가입 시 법정대리인의 성명, 유무선 연락처 등을 제공하여야 합니다.
④ “회사”는 법정대리인의 동의에 대한 확인절차를 거치지 않은 만 14세 미만 “이용자”에 대하여는 회원가입을 불허 또는 취소할 수 있습니다.
⑤ 만 14세 미만 “회원”의 법정대리인은 자녀에 대한 “개인정보”의 열람, 정정, 갱신을 요구하거나 회원가입에 대한 동의를 철회할 수 있으며, 이러한 경우에 “회사”는 지체 없이 필요한 조치를 취해야 합니다. 이 때 “회사”는 법정대리인임을 입증할 수 있는 문서 등 확인서류의 제출을 요청할 수 있습니다.

제 3 장 서비스 제공 및 이용
제11조 [서비스 이용 기술 사양]
① “회사”가 제공하는 “컨텐츠” 등 서비스 이용에 필요한 기술 사양은 ”웹사이트”의 ‘자주묻는질문’에 표시합니다.
② 전 항보다 고사양이 요구되거나 컴퓨터 이외의 다른 장치로 이용이 가능한 “컨텐츠”의 경우 “회사”는 해당 “컨텐츠”의 포장 또는 “웹사이트”에 그 내용을 표시할 수 있습니다.

제12조 [서비스 이용 요금]
① 별도로 표시된 유료 “서비스”를 제외한 모든 “서비스”는 무료로 제공됩니다. 유료 또는 무료로 제공되는 “서비스”는 회사 정책에 따라 변경될 수 있습니다.
② 유료 “서비스”의 이용 요금 및 결제 방식은 해당 “서비스” 및 결제 페이지에 명시되어 있는 내용에 따릅니다.
③ “포인트”라 함은 “회사”가 “회원”에게 혜택을 주기 위해 운영하는 가상의 지불수단을 말하며, “회사”는 “포인트”에 관한 정책을 “회사” 운영 상황에 따라 변경할 수 있으며 이를 “웹사이트”에 게시합니다.

제13조 [서비스 이용 시간 및 문의]
① “서비스”는 “회사”의 업무상, 기술상 문제 등 기타 특별한 사정이 없는 한 매일 24시간 운영함을 원칙으로 합니다. 단, “회사”는 일부 “서비스”의 이용 가능 시간을 별도로 정할 수 있으며, 이 경우 “웹사이트”를 통해 공지합니다.
② “이용자”는 “서비스” 이용 중 일반 학습 상담, 동영상 재생 오류 및 기술 상담, 강의 환불 및 변경 문의 기타 “서비스” 이용과 관련하여 문의 사항이 있는 경우 “웹사이트” 고객센터를 이용하여 온라인 문의를 하거나 또는 “회사”의 고객센터로 전화 문의를 할 수 있습니다.
③ “회사”는 원활한 “서비스” 제공을 위하여 “이용자”가 전 항에 의하여 문의하는 사항을 저장녹음하여 활용할 수 있습니다.

제14조 [서비스 제공의 중지 및 제한]
① “회사”는 다음 각 호 어느 하나에 해당하는 경우 “서비스” 제공을 중지하거나 제한할 수 있습니다.
1. 서비스용 설비의 최적화를 위한 시스템 점검 또는 설비 보수로 인해 부득이한 경우
2. 분산서비스거부(DDoS) 공격 등에 의해 발생한 서비스 장애 복구를 위해 부득이한 경우
3. 기타 서비스용 설비의 장애 또는 “서비스” 이용의 폭주 등으로 “서비스” 이용에 지장이 있는 경우
4. 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
5. 국가비상사태, 천재지변에 의해 부득이한 경우
6. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우
② “회사”가 전 항에 의하여 “서비스” 제공을 중지하거나 제한하는 경우 “회사”는 이를 “웹사이트”에 공지하는 등의 방법으로 “이용자”에게 알려드립니다. 다만, “서비스” 제공 중지 또는 제한 사유에 따라 “이용자”에 대한 공지가 곤란한 경우에는 예외로 합니다.
③ “회사”의 귀책사유로 “서비스” 제공이 중지되거나 그 이용에 장애가 발생하는 경우에는 “회사”의 규정에 따라 이용이 중지되거나 장애가 발생한 시간만큼 이용 기간을 연장합니다. 다만, 천재지변 또는 이에 준하는 불가항력으로 인하여 “서비스” 제공이 중지되거나 그 이용에 장애가 발생하는 경우에는 예외로 합니다.
④ “회사”의 귀책사유로 “컨텐츠” 자체에 이용하기 어려운 하자가 있는 경우에는 “회사”의 규정에 따라 그 하자가 복구되지 못한 기간만큼 이용 기간을 연장합니다. 다만, 완전한 “컨텐츠”를 다시 제공하는 것이 불가능한 경우에는 “회사”의 규정에 따라 다른 방법으로 그에 대한 보상을 실시할 수 있습니다.

제15조 [유료 서비스 이용의 승인]
① “회사”는 “회사”에서 규정한 결제 방법을 사용하여 “신청자”가 이용 요금을 납입한 사실이 확인되면 지체 없이 그 유료 “서비스” 이용 신청을 승인합니다.
② “회사”는 다음 각 호 어느 하나에 해당하는 경우 전 항의 승인을 제한할 수 있고 그 사유가 해소될 때까지 승인을 유보할 수 있습니다.
1. 유료 “서비스” 이용 요금을 납입하지 않은 경우
2. 유료 “서비스” 신청 금액 총액과 납입 금액 총액이 일치하지 않는 경우
3. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우
③ “회사”는 전 항에 의하여 유료 “서비스” 이용 신청의 승인을 제한하거나 유보하는 경우 이를 그 “신청자”에게 알려야 합니다.

제16조 [수강 기간의 경과]
“회사”가 유료 “서비스” 이용을 승인한 후 “회원”이 수강을 시작하지 않았거나 수강 도중 정지하여 두었다 하더라도 수강 기간은 자동 진행됩니다. 단, “컨텐츠”의 포장 또는 “웹사이트”상에 별도의 내용이 기재된 “서비스”에 대해서는 기재된 내용에 따릅니다.

제17조 [청약철회 등]
① “회사”와 “컨텐츠”의 이용 계약을 체결한 “회원”은 “서비스” 이용 승인일로부터 7일 이내에 청약철회를 할 수 있습니다.
② “회사”와 “교재”의 구매 계약을 체결한 “회원”은 “교재”를 공급받은 날로부터 7일 이내에 청약철회를 할 수 있습니다.
③ 제2항의 청약철회권은 다음 각 호의 어느 하나에 해당할 경우 행사할 수 없습니다.
1. “회원”에게 책임이 있는 사유로 교재가 멸실되거나 훼손된 경우
2. “회원”의 사용 또는 일부 소비로 “교재”의 가치가 현저히 감소한 경우
3. 시간이 지나 다시 판매하기 곤란할 정도로 “교재”의 가치가 현저히 감소한 경우
4. 복제가 가능한 “교재”의 포장을 훼손한 경우
④ “회원”은 제1항, 제2항 및 제3항에도 불구하고 “컨텐츠”, “교재”의 내용이 표시∙광고의 내용과 다르거나 계약내용과 다르게 이행된 경우에는 그 “컨텐츠”, “교재”를 공급받은 날부터 3개월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회를 할 수 있습니다.
⑤ 단기간 강의 • 이벤트 강의 등 특별한 경우의 청약철회, 수강 강의의 변경 등은 본 조항과는 별도로 “컨텐츠” 포장 또는 “웹사이트”상에 표시된 조건이 적용됩니다.

제18조 [청약철회의 효과]
① “회사”는 “이용자”의 청약철회의 의사표시를 받은 날로부터 3영업일 이내(교재 등 “이용자”가 ”회사”에 반환하여야 할 재화등이 있는 경우에는 해당 재화등을 반환 받은 날로부터 3영업일 이내)에 대금 결제와 동일한 방법으로 대금을 환불합니다.
② “회사”는 반환된 컨텐츠가 일부 사용 또는 소비된 경우 그 컨텐츠의 사용 또는 소비에 의하여 “이용자”가 얻은 이익에 상당하는 금액의 범위 내에서 “이용자”에게 청구하거나 “이용자”에게 반환할 대금에서 상계할 수 있습니다.
③ ”이용자”의 사유로 인하여 청약철회를 하는 경우 재화등의 배송에 소요된 비용은 소비자가 부담합니다.

제19조 [과오금의 환불]
① “회사”는 유료 “서비스” 결제와 관련하여 과오금이 발생한 경우 대금결제와 동일한 방법으로 그 과오금을 “회원”에게 환불합니다.
② “회사”의 책임 있는 사유로 과오금이 발생한 경우 “회사”는 과오금 전액을 환급합니다. 다만, “이용자”의 책임 있는 사유로 과오금이 발생한 경우, 과오금의 환급에 소요되는 비용은 “이용자”가 부담합니다.

제20조 [해제, 해지 등]
① “회사”의 귀책사유로 더 이상 “서비스” 제공이 불가능한 경우에는 “이용자”는 그 서비스 제공을 해제 또는 해지할 수 있습니다. 이 때, “회사”는 “이용자”가 결제한 금액 중 이미 이용한 부분에 대한 금액을 제한 나머지 금액을 “이용자”에게 환불합니다.
② “회사”는 “이용자”의 계약 해제, 해지의 의사표시를 받은 날로부터 3영업일 이내(교재 등 “이용자”가 “회사”에 반환하여야 할 재화등이 있는 경우에는 해당 재화등을 반환 받은 날로부터 3영업일 이내)에 대금 결제와 동일한 방법으로 대금을 환불합니다. 다만, 동일한 방법으로 대금의 환불이 불가능할 때에는 이를 고지하고, 회원이 선택한 방법으로 환불할 수 있습니다.

제21조 [환불에 관한 사항]
① “회원”은 “웹사이트” 등을 이용하여 환불 신청을 할 수 있습니다. 다만, 필요한 경우 고객센터를 이용할 수 있습니다.
② 환불과 관련하여 본 약관에서 규정하고 있지 않은 사항은 상품 구매시 “회원”이 별도로 동의한 계약내용 또는 관련 법령에 의하여 정해진 “회사”의 환불처리기준에 의합니다.

제 4 장 당사자의 권리와 의무
제22조 [회사의 의무]
① “회사”는 지속적 안정적으로 “서비스”를 제공하기 위해 최선을 다합니다.
② “회사”는 “서비스” 이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하도록 노력합니다.
③ “회사”는 “회원”의 “개인정보”를 그 “회원”의 동의 없이 제 3자에게 누설, 배포하지 않는 것을 원칙으로 합니다. 단, 다음 각 호의 1에 해당하는 경우에는 예외로 합니다.
1. 전기통신기본법 등 법률의 규정에 의한 국가기관의 요구가 있는 경우
2. 범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우
3. 기타 관계법령이 정한 절차에 따른 요청이 있는 경우

제23조 [개인정보 보호 등]
① “회사”는 “회원”의 “개인정보” 수집 시 필요한 최소한의 정보를 수집합니다.
② “회사”는 “회원”의 “개인정보”를 수집할 때 다음 각 호의 1에 해당하는 경우를 제외하고는 그 “회원”의 동의를 받습니다.
1. 법률에 특별한 규정이 있는 경우
2. 전자거래 계약의 이행을 위하여 필요한 경우
3. “서비스” 제공에 따른 요금 정산을 위하여 필요한 경우
③ “회사”는 “회원”의 “개인정보”를 그 “회원”의 동의 없이 목적 외로 사용하거나 제3자에게 제공할 수 없습니다. 단, 다음 각 호의 1에 해당하는 경우에는 예외로 합니다.
1. 법률에 특별한 규정이 있는 경우
2. “서비스” 제공에 따른 요금 정산을 위해 필요한 경우
3. 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공되는 경우
④ “회원”은 “웹사이트”상의 개인정보관리 시스템을 통해 언제든지 본인의 “개인정보”를 열람하고 수정할 수 있습니다. 다만, “아이디”는 변경할 수 없습니다.
⑤ “회원”은 가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정해야 하며, 이를 수정하지 아니하여 발생하는 문제의 책임은 “회원”에게 있습니다.
⑥ 개인정보의 수집목적 또는 제공받은 목적을 달성하거나 이용자의 서비스 미이용기간이 1년을 초과한 경우에는 별도 분리하여 보관합니다.
⑦ 전 항의 경우라도 “회사”가 사전에 개인정보처리방침에 규정하여 “회원”의 동의를 받거나 관련 법령에 따라 일정기간 “개인정보”를 보관해야 하는 경우 “회사”는 예외적으로 일정기간 “개인정보”를 보관할 수 있습니다.
⑧ “개인정보”의 수집, 보관, 이용, 위탁 등에 관한 제반 사항은 “회사”가 게시한 개인정보처리방침에서 확인할 수 있습니다.

제24조 [회원의 아이디와 비밀번호 관리에 대한 의무]
① “아이디”와 비밀번호에 관한 모든 관리책임은 “회원”에게 있습니다.
② 자신의 “아이디”가 부정하게 사용된 경우, “회원”은 반드시 “회사”에 그 사실을 통보해야 합니다.
③ “회사”는 전항의 경우 “회원”의 개인정보보호 및 기타 서비스 부정이용행위 방지 등을 위하여 “회원”에게 비밀번호의 변경 등 필요한 조치를 요구할 수 있으며, “회원”은 “회사”의 요구가 있는 즉시 “회사”의 요청에 성실히 응해야 합니다.
④ “회사”는 “회원”이 본 조에서 정하는 의무를 성실히 이행하지 않아 발생한 불이익에 대하여 책임지지 않습니다.

제25조 [회원의 의무]
① “회원”은 “서비스”를 이용할 때 다음 각 호의 행위를 해서는 안 됩니다.
1. 동일인이 중복하여 회원가입을 하는 경우
2. 다른 “회원”의 “아이디”를 부정하게 사용하는 행위
3. 자신의 “아이디” 및 “서비스”를 타인이 사용하도록 하는 행위
4. “서비스” 이용 시 영상, 사진, 텍스트, 음성 등의 정보를 녹화나 캡쳐 또는 녹음할 수 있는 소프트웨어를 실행시키는 행위
5. “서비스”에서 얻은 정보를 “회사”의 사전 승낙 없이 복제하거나 이를 출판 및 방송 등에 사용하거나 제 3자에게 제공하는 행위
6. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해하려는 행위
7. 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등을 타인에게 유포하는 행위
8. 범죄와 결부된다고 객관적으로 판단되는 행위
9. “회원”이 다른 “이용자”의 서비스 이용을 방해하거나, “회사”의 서비스 운영을 고의 또는 과실로 방해하는 행위
10. 회사 및 타인의 명예를 훼손하거나 모욕하는 행위
11. “회원”이 “회사”에서 제공하는 서비스를 이용하여 상품 또는 용역 등을 판매하는 상행위
12. 기타 관계법령에 위배되는 행위
② “회원”은 본 약관에 규정하는 사항과 “서비스” 이용안내 또는 주의사항을 준수해야 합니다.
③ “회원”은 사항 별로 “회사”가 “서비스” 공지사항에 게시하거나 별도로 공지한 사항을 준수해야 합니다.
④ “회원”은 “회사”의 명시적인 동의가 없는 한 “서비스”의 이용권한 기타 이용 계약상의 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다.
⑤ “회사”는 “회원”이 제1항 내지 제4항을 위반하였을 경우 사전 통지 없이 계약을 해지하거나 또는 “서비스” 이용을 제한할 수 있습니다.
⑥ “회사”가 전 항에 따라 계약을 해지하거나 “서비스” 이용을 제한하는 경우 이를 “회원”에게 알립니다. 다만, “회사”의 귀책사유 없이 “회원”에게 알릴 수 없는 경우에는 예외로 합니다.
⑦ 특히 “회원”이 다음 각 호의 1에 해당하는 행위를 하였을 경우 1회 적발 시에는 경고 또는 10일 미만의 기간 동안 “웹사이트”에 로그인 또는 “컨텐츠” 이용이 금지될 수 있으며, 2회 이상 적발 시에는 10일 이상의 기간 동안 “웹사이트”에 로그인이 금지되거나 남은 강의에 대한 수강권 또는 경우에 따라서는 “회원” 자격까지 박탈될 수 있습니다.
1. “회원”이 로그인하여 강의를 수강하고 있는 도중에 다른 아이피에서 같은 “아이디”로 로그인하여 수강하는 일이 발생하는 경우
2. “회원”이 로그아웃 후 일정 시간 경과 후 다른 지역의 아이피에서 다시 로그인하였는데, 그 일정 시간 동안 원래의 로그인 지역에서 다른 지역으로의 이동이 합리적으로 불가능하다 판단되는 경우
⑧ 특히 “회원”이 동조 제1항 제4호의 소프트웨어를 사용하며 강의를 수강하는 경우 1회 적발 시에는 경고 또는 30일 미만의 기간 동안 로그인이 금지될 수 있으며, 2회 이상 적발 시에는 30일 이상의 기간 동안 로그인이 금지되거나, 남은 강의에 대한 수강권 또는 경우에 따라서는 “회원” 자격까지 박탈될 수 있습니다.
⑨ 전 2항의 경우 로그인이 금지되는 기간 동안에도 해당 강의의 수강기간은 그대로 경과됩니다.
⑩ 중복 가입된 계정으로 회사가 제공하는 혜택을 중복수령하는 경우, 혜택을 받지 못하며 이미 제공받은 혜택은 회사에 반환하여야 합니다.

제26조 [게시물]
① “회사”는 “게시물”이 다음 각 호의 1에 해당된다고 판단되는 경우에는 그 “이용자”의 동의 없이 그 “게시물”을 삭제할 수 있습니다.
1. 다른 “이용자” 또는 제 3자를 비방하거나 중상 모략함으로써 타인의 명예를 훼손시킨 경우
2. 허위 내용이 포함되어 있거나 공공질서 및 미풍양속에 위반되는 경우
3. 범죄적 행위에 결부된다고 인정되는 경우
4. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해할 우려가 있는 경우
5. 기타 관계 법령이나 “회사”가 정한 규정에 위배되는 경우
② “회사”가 운영하는 “게시판” 등에 게시된 정보로 인하여 법률상 이익이 침해된 자는 권리 침해 사실을 소명하여 “회사”에게 당해 정보의 삭제를 요청할 수 있습니다. 이 경우 “회사”는 신속히 필요한 조치를 취하고 이를 요청자에게 통지합니다.

제 5 장 회원 탈퇴 및 자격 상실
제27조 [회원 탈퇴]
① “회원”이 “웹사이트”의 회원 탈퇴를 하고자 하는 경우에는 “회원” 본인 또는 “회원”의 법정대리인이 “회사”에 회원 탈퇴의 신청을 하여야 합니다.
② “회원”의 회원 탈퇴 신청을 확인한 경우 “회사”는 신속히 회원 탈퇴 절차를 처리하며, 관련법 및 “웹사이트”의 개인정보처리방침에 따라 “회사”가 회원정보를 보유하는 경우를 제외하고는 탈퇴 완료 후 지체 없이 “회원”의 개인정보를 파기합니다.
③ 본 조항에 따른 해지 시 회원은 이용계약 종료(회원 탈퇴) 이전에 잔여 포인트, 할인 쿠폰을 모두 사용하여야 하며, 이용계약이 종료됨과 함께 잔여 포인트, 할인 쿠폰 및 수강중인 “컨텐츠” 등 보유하고 있는 권리는 소멸됩니다.

제28조 [회원 자격 상실 및 정지]
① “회사”는 “회원”이 다음 각 호의 1에 해당하는 행위를 하였을 경우 사전 통지 없이 “회원” 자격을 상실시키거나 “회원” 자격을 정지시킬 수 있습니다.
1. 타인의 “개인정보”, “아이디” 및 비밀번호를 도용한 경우
2. 가입한 이름이 실명이 아닌 경우
3. 같은 “이용자”가 다른 “아이디”로 이중 등록을 한 경우
4. 타인의 명예를 손상시키거나 불이익을 주는 행위를 하는 경우
5. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해하려는 행위를 한 경우
6. 공공질서 및 미풍양속에 저해되는 내용을 유포시키는 경우
7. “회원”이 국익 또는 사회적 공익을 저해할 목적으로 “서비스” 이용을 계획 또는 실행하는 경우
8. “서비스” 운영을 고의 또는 과실로 방해하는 경우
9. “서비스”의 안정적 운영을 방해할 목적으로 다량의 정보를 전송하거나 광고성 정보를 전송하는 경우
10. 정보통신설비의 오작동이나 정보의 파괴를 유발시키는 컴퓨터 바이러스 프로그램 등을 유포하는 경우
11. 정보통신윤리위원회 등 외부기관의 시정 요구가 있거나 불법선거운동과 관련하여 선거관리위원회의 유권해석을 받은 경우
12. “회사”의 “서비스”를 이용하여 얻은 정보를 “회사”의 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 경우
13. “웹사이트”에 음란물을 게재하거나 음란 사이트를 링크하는 경우
14. 본 약관 기타 “회사”가 정한 의무 기타 이용 조건을 위반하는 경우
15. “회사”의 명시적인 동의 없이 “회사”가 제공하는 “서비스”를 녹화, 녹음, 캡쳐하거나 하려는 경우
16. “서비스”를 이용하는 동안 제25조 제1항 제4호의 소프트웨어를 사용하거나 사용하려고 시도한 경우
17. “회사”의 명시적인 동의 없이 “서비스”의 이용권한 기타 이용 계약상의 지위를 타인에게 양도, 증여, 담보 제공, 이용 허락 하거나 타인과 공유하는 경우
② “회사”가 전 항에 따라 “회원” 자격을 상실시키거나 제한하는 경우에는 “회사”는 이를 “회원”에게 알립니다. 다만, “회사”의 귀책사유 없이 “회원”에게 알릴 수 없는 경우에는 예외로 합니다.
③ “회사”가 제1항에 따라 “회원” 자격을 상실시키거나 제한하는 경우 해당 “회원”에 대하여는 “회사”가 제공하는 모든 “서비스”의 이용을 중단시킬 수 있고, 해당 “회원”은 “회사”에 대하여 중단 이후의 “서비스”에 대한 환불 등을 요구할 수 없습니다.

제 6 장 기타

제29조 [저작권]
① “회사”가 자체 제작한 “컨텐츠”와 “회사”가 제3자로부터 저작권을 양수 받은 “컨텐츠”에 대한 저작권은 “회사”에게 있습니다.
② “회사”가 제3자로부터 이용 허락을 받은 “컨텐츠”에 대한 저작권은 제3자에게 있고 “회사”는 그에 대한 사용권을 가집니다.
③ “회원”은 “회사”가 제공하는 “서비스”를 이용함으로써 얻은 정보를 “회사”의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리, 비영리의 목적으로 이용하거나 제 3자에게 이용하게 할 수 없습니다.
④ “회사”는 “회사” 또는 제3자의 저작권을 보호하기 위하여 “회원”이 “서비스”를 이용하는 동안 “회원”의 컴퓨터에 제25조 제1항 제4호의 소프트웨어가 실행되는 것을 감지하여 자동으로 차단하는 프로그램을 사용할 수 있습니다.
⑤ “회원”의 “게시물”에 대한 권리 및 책임은 이를 게시한 “회원”에게 있습니다.
⑥ “회사”는 “회원”이 “웹사이트”에 게시한 수강후기 등의 “게시물”을 사용, 복제, 전송, 수정, 출판, 배포할 수 있다. 단, “회원”의 “게시물”을 마케팅 등에 활용하는 경우 별도의 동의를 받지 않는 한 “회원”의 개인정보를 비식별화 조치하여 활용합니다.

제30조 [손해배상]
회원이 본 약관의 규정을 위반하여 회사 또는 제 3자에게 손해가 발생하게 되는 경우, 약관을 위반한 회원은 회사 및 제 3자에게 발생한 손해를 배상할 책임이 있습니다.

제31조 [면책조항]
① “회사”는 천재지변 또는 이에 준하는 불가항력으로 인하여 “서비스”를 제공할 수 없는 경우에는 “서비스” 제공에 관한 책임이 면제됩니다.
② “회사”는 “회원”의 사유로 인한 “서비스” 이용의 장애에 대하여 책임을 지지 않습니다.
③ “회사”는 “이용자”가 “웹사이트”에 게재한 사실의 신뢰도, 정보나 자료의 정확성 등 내용에 관하여는 책임을 지지 않습니다.
④ “회사”는 “서비스” 이용과 관련하여 “이용자”에게 발생한 손해 가운데 “이용자”의 사유에 의한 손해에 대하여 책임을 지지 않습니다.

제32조 [분쟁의 해결]

① “회사”는 “이용자”가 제기하는 의견이나 불만에 대하여 신속하게 처리하여야 합니다.
② “회사”와 “이용자” 사이에 분쟁이 발생한 경우 “회사” 또는 “이용자”는 콘텐츠분쟁조정위원회에 분쟁조정을 신청할 수 있습니다.

제33조 [학원 강의의 온라인 수강신청 등]
① “회원”의 학원 강의 온라인 수강신청, 결제, 취소, 반 변경, 환불 기타 오프라인 학원 수강과 관련된 사항은 온라인 수강신청 시 제공되는 수강접수 약관 및 관련 법령의 내용에 따릅니다.
② 단기간 강의, 이벤트 강의 등 특별한 학원 강의의 이용 등에 관한 경우에는 수강접수 약관 외에 별도의 규정이 적용될 수 있습니다.

[부칙]
본 약관은 2017년 11월 28일부터 시행됩니다.`}
</Text>);
};

const Terms04 = () => {
    return (
        <Text style={signupStyles.termsText}>
            {`
제 1 장 총칙
제1조 [목적]
본 약관은 (주)챔프스터디(이하 “회사”라 합니다)가 www.Hackers.com(이하 “웹사이트”)을 통하여 제공하는 교육 정보 서비스(이하 “서비스”라 합니다)의 이용에 관한 제반 사항을 규정하는 것을 목적으로 합니다.

제2조 [정의]
① “이용자”라 함은 “웹사이트”에 접속하여 본 약관에 따라 “회사”가 제공하는 “컨텐츠” 등 “서비스”를 이용하는 “회원” 및 “비회원”을 말합니다.
② “회원”이라 함은 “웹사이트”에 접속하여 본 약관에 동의함으로써 “아이디”를 부여 받은 자로서 “회사”가 제공하는 “서비스”를 지속적으로 이용할 수 있는 자를 말합니다.
③ “비회원”이라 함은 “웹사이트”에 접속하였으나 본 약관에 동의하지 않음으로써 “아이디”를 부여 받지 못한 자를 말합니다.
④ “아이디”라 함은 회원의 식별 및 “서비스” 이용을 위하여 “회원”이 정하고 “회사”가 승인하는 문자 또는 숫자의 조합을 말합니다.
⑤ “비밀번호”라 함은 서비스 이용시, 아이디와 일치되는 회원임을 확인하고, 회원 개인정보 보호를 위하여, 회원 자신이 정한 문자 또는 숫자의 조합을 말합니다.
⑥ “신청자”라 함은 “회원” 중에서 유료 “서비스” 이용을 신청하였으나 아직 이용 승인을 받지 못한 자를 말합니다.
⑦ “컨텐츠”라 함은 “웹사이트”에서 제공하는 온라인 강의 및 기타 관련 정보를 의미함으로써, 정보통신망에서 사용되는 부호, 문자, 음성, 음향, 이미지 또는 영상 등으로 표현된 자료 또는 정보를 말합니다.
⑧ “패키지”라 함은 “회사”가 “회원”에게 할인 혜택을 부여하기 위해 여러 개의 강의를 하나로 묶어 결제할 수 있도록 한 “컨텐츠”를 말합니다.
⑨ “개인정보”라 함은 생존하는 개인에 관한 정보로서 해당 정보에 포함되어 있는 성명, 주민등록번호 등의 사항에 의하여 해당 개인을 식별할 수 있는 정보를 말합니다.
⑩ “게시물”이라 함은 “이용자”가 “웹사이트”에 게재한 글, 이미지, 각종 파일 및 링크, 각종 댓글 등의 정보를 의미합니다.

제3조 [회사 정보 등의 제공]
“회사”는 “회사”의 상호, 대표자 성명, 주소, 전화번호, 모사전송번호, 전자우편주소, 사업자등록번호, 통신판매업 신고번호, 이용 약관, 개인정보처리방침 및 개인정보보호책임자 등에 대한 정보를 이용자가 쉽게 알 수 있도록 “웹사이트”의 초기화면에 게시합니다.

제4조 [약관의 효력과 변경]
① 본 약관은 “이용자”가 약관의 내용에 동의하며 회원가입을 신청하고, “회사”가 그 신청에 대하여 승낙함으로써 효력이 발생합니다.
② 개별 서비스 계약 시 동의한 약관이 본 약관과 저촉되는 경우 개별 서비스 계약 시 동의한 약관이 우선 적용됩니다.
③ “회사”가 본 약관의 내용을 변경하는 경우 적용일자 및 변경사유를 명시하여 현행약관과 함께 “웹사이트”의 초기화면 또는 초기화면과의 연결화면을 통해 적용일자 최소 7일(이용자에게 불리하거나 중대한 사항의 변경은 30일) 이전부터 적용일자 전일까지 공지하고, 기존 “회원”들에게는 변경 될 약관, 적용일자 및 변경사유를 전자우편주소로 이메일을 발송하여 통지합니다.
④ 전 항과 같이 약관의 변경에 대하여 통지한 경우, 그 때부터 7일(이용자에게 불리하거나 중대한 사항의 변경인 경우 30일)내에 이용자가 거절의 의사를 표시하지 않으면 변경된 약관에 동의한 것으로 간주됩니다. 단, 유료 “서비스”를 이용 중인 “회원” 중 변경될 약관에 동의하지 아니하는 “회원”은 유료 “서비스” 이용이 종료될 때까지는 기존 약관이 적용됩니다.

제5조 [약관 외 준칙]
본 약관과 “웹사이트”에 명시되지 아니한 사항이 관계법령(전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 기타 관련 법령)에 규정되어 있을 경우에는 그 규정에 따릅니다.

제6조 [회원에 대한 통지]
① “회사”는 “회원”에게 알려야 할 사항이 발생하는 경우 회원가입 시 “회원”이 공개한 전자우편주소로 이메일을 보내거나 “웹사이트”에 공지란 또는 팝업창을 게시하는 방법 등으로 통지할 수 있습니다.
② 전 항과 같이 통지한 경우 그 때부터 7일 이내에 “회원”이 “회사”가 정하는 방법으로 그 통지 내용에 동의하지 않음을 표시하지 않을 경우 그 “회원”에게는 통지 내용이 도달하였고 통지 내용에 동의하였다고 간주됩니다.
③ 통지 내용에 동의하지 아니하는 “회원”은 “회사”가 정하는 방법으로 그 의사를 표시할 수 있습니다.

제 2 장 회원가입
제7조 [회원가입]
① 회원가입은 “서비스”를 이용하려는 자가 본 약관의 내용에 동의하고 회원가입 신청을 한 후 “회사”가 이러한 신청에 대하여 승낙함으로써 완료됩니다.
② 전 항의 규정에 따라 회원가입을 할 때에는 “회사”가 제공하는 “서비스”의 원활한 이용을 위해서 필요한 “개인정보”를 제공해야 합니다. 이 경우 제공되는 “개인정보”는 “회사”가 게시한 개인정보처리방침에서 확인할 수 있습니다.

제8조 [회원가입 신청]
① “회원”으로 가입하여 “서비스”를 이용하기를 희망하는 자는 “회사”가 요청하는 소정의 신규회원가입 양식에서 요구하는 사항을 기록하여 신청합니다.
② 온라인 가입신청 양식에 기재하는 사항에 실명이나 실제 정보를 입력하지 않은 자는 법적인 보호를 받을 수 없으며, “서비스” 사용의 제한을 받을 수 있습니다.

제9조 [회원가입 신청에 대한 승낙]
① 승낙은 "회사”가 회원가입 신청을 한 자에게 “아이디”, 서비스 이용개시를 통보함으로써 이루어집니다.
② “회사”는 다음 각 호 어느 하나에 해당하는 경우 회원가입 신청에 대하여 승낙하지 아니합니다.
1. 본인의 실명으로 신청하지 않은 경우
2. 다른 사람의 명의를 빌리거나 도용하여 차명으로 신청한 경우
3. 회원가입 신청서의 내용을 허위로 기재했거나 첨부한 경우
4. 관계법령에 위배되거나 사회의 안녕질서 혹은 미풍양속을 저해할 수 있는 목적으로 신청한 경우
5. “웹사이트”의 회원을 탈퇴한 후 “회사”가 정한 일정 기간이 경과되지 않은 경우
6. 기타 “회사”가 정한 회원가입 신청 요건이 미비된 경우
③ “회사”는 다음 각 호 어느 하나에 해당하는 경우에는 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.
1. 서비스 관련 설비의 용량이 부족한 경우
2. 기술상 또는 업무 수행상 지장이 있는 경우
3. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우

제10조 [만 14세 미만 아동의 회원가입에 관한 특칙]
① 만 14세 미만의 “이용자”는 “회사”의 ”웹사이트”에서 제공되는 개인정보처리방침과 본 약관을 충분히 숙지한 후, 반드시 법정대리인의 동의를 얻어 회원가입을 신청하여야 합니다.
② “회사”는 만 14세 미만의 “이용자”가 회원가입을 신청하는 경우 별도의 안내 또는 절차를 통하여 법정대리인의 동의 여부를 확인할 수 있습니다.
③ 만 14세 미만의 “이용자”는 “회사”가 법정대리인에게 전 항의 동의사실 여부를 확인 할 수 있도록 회원가입 시 법정대리인의 성명, 유무선 연락처 등을 제공하여야 합니다.
④ “회사”는 법정대리인의 동의에 대한 확인절차를 거치지 않은 만 14세 미만 “이용자”에 대하여는 회원가입을 불허 또는 취소할 수 있습니다.
⑤ 만 14세 미만 “회원”의 법정대리인은 자녀에 대한 “개인정보”의 열람, 정정, 갱신을 요구하거나 회원가입에 대한 동의를 철회할 수 있으며, 이러한 경우에 “회사”는 지체 없이 필요한 조치를 취해야 합니다. 이 때 “회사”는 법정대리인임을 입증할 수 있는 문서 등 확인서류의 제출을 요청할 수 있습니다.

제 3 장 서비스 제공 및 이용
제11조 [서비스 이용 기술 사양]
① “회사”가 제공하는 “컨텐츠” 등 서비스 이용에 필요한 기술 사양은 ”웹사이트”의 ‘자주묻는질문’에 표시합니다.
② 전 항보다 고사양이 요구되거나 컴퓨터 이외의 다른 장치로 이용이 가능한 “컨텐츠”의 경우 “회사”는 해당 “컨텐츠”의 포장 또는 “웹사이트”에 그 내용을 표시할 수 있습니다.

제12조 [서비스 이용 요금]
① 별도로 표시된 유료 “서비스”를 제외한 모든 “서비스”는 무료로 제공됩니다. 유료 또는 무료로 제공되는 “서비스”는 회사 정책에 따라 변경될 수 있습니다.
② 유료 “서비스”의 이용 요금 및 결제 방식은 해당 “서비스” 및 결제 페이지에 명시되어 있는 내용에 따릅니다.
③ “포인트”라 함은 “회사”가 “회원”에게 혜택을 주기 위해 운영하는 가상의 지불수단을 말하며, “회사”는 “포인트”에 관한 정책을 “회사” 운영 상황에 따라 변경할 수 있으며 이를 “웹사이트”에 게시합니다.

제13조 [서비스 이용 시간 및 문의]
① “서비스”는 “회사”의 업무상, 기술상 문제 등 기타 특별한 사정이 없는 한 매일 24시간 운영함을 원칙으로 합니다. 단, “회사”는 일부 “서비스”의 이용 가능 시간을 별도로 정할 수 있으며, 이 경우 “웹사이트”를 통해 공지합니다.
② “이용자”는 “서비스” 이용 중 일반 학습 상담, 동영상 재생 오류 및 기술 상담, 강의 환불 및 변경 문의 기타 “서비스” 이용과 관련하여 문의 사항이 있는 경우 “웹사이트” 고객센터를 이용하여 온라인 문의를 하거나 또는 “회사”의 고객센터로 전화 문의를 할 수 있습니다.
③ “회사”는 원활한 “서비스” 제공을 위하여 “이용자”가 전 항에 의하여 문의하는 사항을 저장녹음하여 활용할 수 있습니다.

제14조 [서비스 제공의 중지 및 제한]
① “회사”는 다음 각 호 어느 하나에 해당하는 경우 “서비스” 제공을 중지하거나 제한할 수 있습니다.
1. 서비스용 설비의 최적화를 위한 시스템 점검 또는 설비 보수로 인해 부득이한 경우
2. 분산서비스거부(DDoS) 공격 등에 의해 발생한 서비스 장애 복구를 위해 부득이한 경우
3. 기타 서비스용 설비의 장애 또는 “서비스” 이용의 폭주 등으로 “서비스” 이용에 지장이 있는 경우
4. 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
5. 국가비상사태, 천재지변에 의해 부득이한 경우
6. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우
② “회사”가 전 항에 의하여 “서비스” 제공을 중지하거나 제한하는 경우 “회사”는 이를 “웹사이트”에 공지하는 등의 방법으로 “이용자”에게 알려드립니다. 다만, “서비스” 제공 중지 또는 제한 사유에 따라 “이용자”에 대한 공지가 곤란한 경우에는 예외로 합니다.
③ “회사”의 귀책사유로 “서비스” 제공이 중지되거나 그 이용에 장애가 발생하는 경우에는 “회사”의 규정에 따라 이용이 중지되거나 장애가 발생한 시간만큼 이용 기간을 연장합니다. 다만, 천재지변 또는 이에 준하는 불가항력으로 인하여 “서비스” 제공이 중지되거나 그 이용에 장애가 발생하는 경우에는 예외로 합니다.
④ “회사”의 귀책사유로 “컨텐츠” 자체에 이용하기 어려운 하자가 있는 경우에는 “회사”의 규정에 따라 그 하자가 복구되지 못한 기간만큼 이용 기간을 연장합니다. 다만, 완전한 “컨텐츠”를 다시 제공하는 것이 불가능한 경우에는 “회사”의 규정에 따라 다른 방법으로 그에 대한 보상을 실시할 수 있습니다.

제15조 [유료 서비스 이용의 승인]
① “회사”는 “회사”에서 규정한 결제 방법을 사용하여 “신청자”가 이용 요금을 납입한 사실이 확인되면 지체 없이 그 유료 “서비스” 이용 신청을 승인합니다.
② “회사”는 다음 각 호 어느 하나에 해당하는 경우 전 항의 승인을 제한할 수 있고 그 사유가 해소될 때까지 승인을 유보할 수 있습니다.
1. 유료 “서비스” 이용 요금을 납입하지 않은 경우
2. 유료 “서비스” 신청 금액 총액과 납입 금액 총액이 일치하지 않는 경우
3. 기타 합리적인 이유가 있는 경우로서 “회사”가 필요하다고 인정하는 경우
③ “회사”는 전 항에 의하여 유료 “서비스” 이용 신청의 승인을 제한하거나 유보하는 경우 이를 그 “신청자”에게 알려야 합니다.

제16조 [수강 기간의 경과]
“회사”가 유료 “서비스” 이용을 승인한 후 “회원”이 수강을 시작하지 않았거나 수강 도중 정지하여 두었다 하더라도 수강 기간은 자동 진행됩니다. 단, “컨텐츠”의 포장 또는 “웹사이트”상에 별도의 내용이 기재된 “서비스”에 대해서는 기재된 내용에 따릅니다.

제17조 [청약철회 등]
① “회사”와 “컨텐츠”의 이용 계약을 체결한 “회원”은 “서비스” 이용 승인일로부터 7일 이내에 청약철회를 할 수 있습니다.
② “회사”와 “교재”의 구매 계약을 체결한 “회원”은 “교재”를 공급받은 날로부터 7일 이내에 청약철회를 할 수 있습니다.
③ 제2항의 청약철회권은 다음 각 호의 어느 하나에 해당할 경우 행사할 수 없습니다.
1. “회원”에게 책임이 있는 사유로 교재가 멸실되거나 훼손된 경우
2. “회원”의 사용 또는 일부 소비로 “교재”의 가치가 현저히 감소한 경우
3. 시간이 지나 다시 판매하기 곤란할 정도로 “교재”의 가치가 현저히 감소한 경우
4. 복제가 가능한 “교재”의 포장을 훼손한 경우
④ “회원”은 제1항, 제2항 및 제3항에도 불구하고 “컨텐츠”, “교재”의 내용이 표시∙광고의 내용과 다르거나 계약내용과 다르게 이행된 경우에는 그 “컨텐츠”, “교재”를 공급받은 날부터 3개월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회를 할 수 있습니다.
⑤ 단기간 강의 • 이벤트 강의 등 특별한 경우의 청약철회, 수강 강의의 변경 등은 본 조항과는 별도로 “컨텐츠” 포장 또는 “웹사이트”상에 표시된 조건이 적용됩니다.

제18조 [청약철회의 효과]
① “회사”는 “이용자”의 청약철회의 의사표시를 받은 날로부터 3영업일 이내(교재 등 “이용자”가 ”회사”에 반환하여야 할 재화등이 있는 경우에는 해당 재화등을 반환 받은 날로부터 3영업일 이내)에 대금 결제와 동일한 방법으로 대금을 환불합니다.
② “회사”는 반환된 컨텐츠가 일부 사용 또는 소비된 경우 그 컨텐츠의 사용 또는 소비에 의하여 “이용자”가 얻은 이익에 상당하는 금액의 범위 내에서 “이용자”에게 청구하거나 “이용자”에게 반환할 대금에서 상계할 수 있습니다.
③ ”이용자”의 사유로 인하여 청약철회를 하는 경우 재화등의 배송에 소요된 비용은 소비자가 부담합니다.

제19조 [과오금의 환불]
① “회사”는 유료 “서비스” 결제와 관련하여 과오금이 발생한 경우 대금결제와 동일한 방법으로 그 과오금을 “회원”에게 환불합니다.
② “회사”의 책임 있는 사유로 과오금이 발생한 경우 “회사”는 과오금 전액을 환급합니다. 다만, “이용자”의 책임 있는 사유로 과오금이 발생한 경우, 과오금의 환급에 소요되는 비용은 “이용자”가 부담합니다.

제20조 [해제, 해지 등]
① “회사”의 귀책사유로 더 이상 “서비스” 제공이 불가능한 경우에는 “이용자”는 그 서비스 제공을 해제 또는 해지할 수 있습니다. 이 때, “회사”는 “이용자”가 결제한 금액 중 이미 이용한 부분에 대한 금액을 제한 나머지 금액을 “이용자”에게 환불합니다.
② “회사”는 “이용자”의 계약 해제, 해지의 의사표시를 받은 날로부터 3영업일 이내(교재 등 “이용자”가 “회사”에 반환하여야 할 재화등이 있는 경우에는 해당 재화등을 반환 받은 날로부터 3영업일 이내)에 대금 결제와 동일한 방법으로 대금을 환불합니다. 다만, 동일한 방법으로 대금의 환불이 불가능할 때에는 이를 고지하고, 회원이 선택한 방법으로 환불할 수 있습니다.

제21조 [환불에 관한 사항]
① “회원”은 “웹사이트” 등을 이용하여 환불 신청을 할 수 있습니다. 다만, 필요한 경우 고객센터를 이용할 수 있습니다.
② 환불과 관련하여 본 약관에서 규정하고 있지 않은 사항은 상품 구매시 “회원”이 별도로 동의한 계약내용 또는 관련 법령에 의하여 정해진 “회사”의 환불처리기준에 의합니다.

제 4 장 당사자의 권리와 의무
제22조 [회사의 의무]
① “회사”는 지속적 안정적으로 “서비스”를 제공하기 위해 최선을 다합니다.
② “회사”는 “서비스” 이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하도록 노력합니다.
③ “회사”는 “회원”의 “개인정보”를 그 “회원”의 동의 없이 제 3자에게 누설, 배포하지 않는 것을 원칙으로 합니다. 단, 다음 각 호의 1에 해당하는 경우에는 예외로 합니다.
1. 전기통신기본법 등 법률의 규정에 의한 국가기관의 요구가 있는 경우
2. 범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우
3. 기타 관계법령이 정한 절차에 따른 요청이 있는 경우

제23조 [개인정보 보호 등]
① “회사”는 “회원”의 “개인정보” 수집 시 필요한 최소한의 정보를 수집합니다.
② “회사”는 “회원”의 “개인정보”를 수집할 때 다음 각 호의 1에 해당하는 경우를 제외하고는 그 “회원”의 동의를 받습니다.
1. 법률에 특별한 규정이 있는 경우
2. 전자거래 계약의 이행을 위하여 필요한 경우
3. “서비스” 제공에 따른 요금 정산을 위하여 필요한 경우
③ “회사”는 “회원”의 “개인정보”를 그 “회원”의 동의 없이 목적 외로 사용하거나 제3자에게 제공할 수 없습니다. 단, 다음 각 호의 1에 해당하는 경우에는 예외로 합니다.
1. 법률에 특별한 규정이 있는 경우
2. “서비스” 제공에 따른 요금 정산을 위해 필요한 경우
3. 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공되는 경우
④ “회원”은 “웹사이트”상의 개인정보관리 시스템을 통해 언제든지 본인의 “개인정보”를 열람하고 수정할 수 있습니다. 다만, “아이디”는 변경할 수 없습니다.
⑤ “회원”은 가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정해야 하며, 이를 수정하지 아니하여 발생하는 문제의 책임은 “회원”에게 있습니다.
⑥ 개인정보의 수집목적 또는 제공받은 목적을 달성하거나 이용자의 서비스 미이용기간이 1년을 초과한 경우에는 별도 분리하여 보관합니다.
⑦ 전 항의 경우라도 “회사”가 사전에 개인정보처리방침에 규정하여 “회원”의 동의를 받거나 관련 법령에 따라 일정기간 “개인정보”를 보관해야 하는 경우 “회사”는 예외적으로 일정기간 “개인정보”를 보관할 수 있습니다.
⑧ “개인정보”의 수집, 보관, 이용, 위탁 등에 관한 제반 사항은 “회사”가 게시한 개인정보처리방침에서 확인할 수 있습니다.

제24조 [회원의 아이디와 비밀번호 관리에 대한 의무]
① “아이디”와 비밀번호에 관한 모든 관리책임은 “회원”에게 있습니다.
② 자신의 “아이디”가 부정하게 사용된 경우, “회원”은 반드시 “회사”에 그 사실을 통보해야 합니다.
③ “회사”는 전항의 경우 “회원”의 개인정보보호 및 기타 서비스 부정이용행위 방지 등을 위하여 “회원”에게 비밀번호의 변경 등 필요한 조치를 요구할 수 있으며, “회원”은 “회사”의 요구가 있는 즉시 “회사”의 요청에 성실히 응해야 합니다.
④ “회사”는 “회원”이 본 조에서 정하는 의무를 성실히 이행하지 않아 발생한 불이익에 대하여 책임지지 않습니다.

제25조 [회원의 의무]
① “회원”은 “서비스”를 이용할 때 다음 각 호의 행위를 해서는 안 됩니다.
1. 동일인이 중복하여 회원가입을 하는 경우
2. 다른 “회원”의 “아이디”를 부정하게 사용하는 행위
3. 자신의 “아이디” 및 “서비스”를 타인이 사용하도록 하는 행위
4. “서비스” 이용 시 영상, 사진, 텍스트, 음성 등의 정보를 녹화나 캡쳐 또는 녹음할 수 있는 소프트웨어를 실행시키는 행위
5. “서비스”에서 얻은 정보를 “회사”의 사전 승낙 없이 복제하거나 이를 출판 및 방송 등에 사용하거나 제 3자에게 제공하는 행위
6. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해하려는 행위
7. 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등을 타인에게 유포하는 행위
8. 범죄와 결부된다고 객관적으로 판단되는 행위
9. “회원”이 다른 “이용자”의 서비스 이용을 방해하거나, “회사”의 서비스 운영을 고의 또는 과실로 방해하는 행위
10. 회사 및 타인의 명예를 훼손하거나 모욕하는 행위
11. “회원”이 “회사”에서 제공하는 서비스를 이용하여 상품 또는 용역 등을 판매하는 상행위
12. 기타 관계법령에 위배되는 행위
② “회원”은 본 약관에 규정하는 사항과 “서비스” 이용안내 또는 주의사항을 준수해야 합니다.
③ “회원”은 사항 별로 “회사”가 “서비스” 공지사항에 게시하거나 별도로 공지한 사항을 준수해야 합니다.
④ “회원”은 “회사”의 명시적인 동의가 없는 한 “서비스”의 이용권한 기타 이용 계약상의 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다.
⑤ “회사”는 “회원”이 제1항 내지 제4항을 위반하였을 경우 사전 통지 없이 계약을 해지하거나 또는 “서비스” 이용을 제한할 수 있습니다.
⑥ “회사”가 전 항에 따라 계약을 해지하거나 “서비스” 이용을 제한하는 경우 이를 “회원”에게 알립니다. 다만, “회사”의 귀책사유 없이 “회원”에게 알릴 수 없는 경우에는 예외로 합니다.
⑦ 특히 “회원”이 다음 각 호의 1에 해당하는 행위를 하였을 경우 1회 적발 시에는 경고 또는 10일 미만의 기간 동안 “웹사이트”에 로그인 또는 “컨텐츠” 이용이 금지될 수 있으며, 2회 이상 적발 시에는 10일 이상의 기간 동안 “웹사이트”에 로그인이 금지되거나 남은 강의에 대한 수강권 또는 경우에 따라서는 “회원” 자격까지 박탈될 수 있습니다.
1. “회원”이 로그인하여 강의를 수강하고 있는 도중에 다른 아이피에서 같은 “아이디”로 로그인하여 수강하는 일이 발생하는 경우
2. “회원”이 로그아웃 후 일정 시간 경과 후 다른 지역의 아이피에서 다시 로그인하였는데, 그 일정 시간 동안 원래의 로그인 지역에서 다른 지역으로의 이동이 합리적으로 불가능하다 판단되는 경우
⑧ 특히 “회원”이 동조 제1항 제4호의 소프트웨어를 사용하며 강의를 수강하는 경우 1회 적발 시에는 경고 또는 30일 미만의 기간 동안 로그인이 금지될 수 있으며, 2회 이상 적발 시에는 30일 이상의 기간 동안 로그인이 금지되거나, 남은 강의에 대한 수강권 또는 경우에 따라서는 “회원” 자격까지 박탈될 수 있습니다.
⑨ 전 2항의 경우 로그인이 금지되는 기간 동안에도 해당 강의의 수강기간은 그대로 경과됩니다.
⑩ 중복 가입된 계정으로 회사가 제공하는 혜택을 중복수령하는 경우, 혜택을 받지 못하며 이미 제공받은 혜택은 회사에 반환하여야 합니다.

제26조 [게시물]
① “회사”는 “게시물”이 다음 각 호의 1에 해당된다고 판단되는 경우에는 그 “이용자”의 동의 없이 그 “게시물”을 삭제할 수 있습니다.
1. 다른 “이용자” 또는 제 3자를 비방하거나 중상 모략함으로써 타인의 명예를 훼손시킨 경우
2. 허위 내용이 포함되어 있거나 공공질서 및 미풍양속에 위반되는 경우
3. 범죄적 행위에 결부된다고 인정되는 경우
4. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해할 우려가 있는 경우
5. 기타 관계 법령이나 “회사”가 정한 규정에 위배되는 경우
② “회사”가 운영하는 “게시판” 등에 게시된 정보로 인하여 법률상 이익이 침해된 자는 권리 침해 사실을 소명하여 “회사”에게 당해 정보의 삭제를 요청할 수 있습니다. 이 경우 “회사”는 신속히 필요한 조치를 취하고 이를 요청자에게 통지합니다.

제 5 장 회원 탈퇴 및 자격 상실
제27조 [회원 탈퇴]
① “회원”이 “웹사이트”의 회원 탈퇴를 하고자 하는 경우에는 “회원” 본인 또는 “회원”의 법정대리인이 “회사”에 회원 탈퇴의 신청을 하여야 합니다.
② “회원”의 회원 탈퇴 신청을 확인한 경우 “회사”는 신속히 회원 탈퇴 절차를 처리하며, 관련법 및 “웹사이트”의 개인정보처리방침에 따라 “회사”가 회원정보를 보유하는 경우를 제외하고는 탈퇴 완료 후 지체 없이 “회원”의 개인정보를 파기합니다.
③ 본 조항에 따른 해지 시 회원은 이용계약 종료(회원 탈퇴) 이전에 잔여 포인트, 할인 쿠폰을 모두 사용하여야 하며, 이용계약이 종료됨과 함께 잔여 포인트, 할인 쿠폰 및 수강중인 “컨텐츠” 등 보유하고 있는 권리는 소멸됩니다.

제28조 [회원 자격 상실 및 정지]
① “회사”는 “회원”이 다음 각 호의 1에 해당하는 행위를 하였을 경우 사전 통지 없이 “회원” 자격을 상실시키거나 “회원” 자격을 정지시킬 수 있습니다.
1. 타인의 “개인정보”, “아이디” 및 비밀번호를 도용한 경우
2. 가입한 이름이 실명이 아닌 경우
3. 같은 “이용자”가 다른 “아이디”로 이중 등록을 한 경우
4. 타인의 명예를 손상시키거나 불이익을 주는 행위를 하는 경우
5. “회사” 또는 제 3자의 저작권 등 지적재산권 기타 권리를 침해하거나 침해하려는 행위를 한 경우
6. 공공질서 및 미풍양속에 저해되는 내용을 유포시키는 경우
7. “회원”이 국익 또는 사회적 공익을 저해할 목적으로 “서비스” 이용을 계획 또는 실행하는 경우
8. “서비스” 운영을 고의 또는 과실로 방해하는 경우
9. “서비스”의 안정적 운영을 방해할 목적으로 다량의 정보를 전송하거나 광고성 정보를 전송하는 경우
10. 정보통신설비의 오작동이나 정보의 파괴를 유발시키는 컴퓨터 바이러스 프로그램 등을 유포하는 경우
11. 정보통신윤리위원회 등 외부기관의 시정 요구가 있거나 불법선거운동과 관련하여 선거관리위원회의 유권해석을 받은 경우
12. “회사”의 “서비스”를 이용하여 얻은 정보를 “회사”의 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 경우
13. “웹사이트”에 음란물을 게재하거나 음란 사이트를 링크하는 경우
14. 본 약관 기타 “회사”가 정한 의무 기타 이용 조건을 위반하는 경우
15. “회사”의 명시적인 동의 없이 “회사”가 제공하는 “서비스”를 녹화, 녹음, 캡쳐하거나 하려는 경우
16. “서비스”를 이용하는 동안 제25조 제1항 제4호의 소프트웨어를 사용하거나 사용하려고 시도한 경우
17. “회사”의 명시적인 동의 없이 “서비스”의 이용권한 기타 이용 계약상의 지위를 타인에게 양도, 증여, 담보 제공, 이용 허락 하거나 타인과 공유하는 경우
② “회사”가 전 항에 따라 “회원” 자격을 상실시키거나 제한하는 경우에는 “회사”는 이를 “회원”에게 알립니다. 다만, “회사”의 귀책사유 없이 “회원”에게 알릴 수 없는 경우에는 예외로 합니다.
③ “회사”가 제1항에 따라 “회원” 자격을 상실시키거나 제한하는 경우 해당 “회원”에 대하여는 “회사”가 제공하는 모든 “서비스”의 이용을 중단시킬 수 있고, 해당 “회원”은 “회사”에 대하여 중단 이후의 “서비스”에 대한 환불 등을 요구할 수 없습니다.

제 6 장 기타

제29조 [저작권]
① “회사”가 자체 제작한 “컨텐츠”와 “회사”가 제3자로부터 저작권을 양수 받은 “컨텐츠”에 대한 저작권은 “회사”에게 있습니다.
② “회사”가 제3자로부터 이용 허락을 받은 “컨텐츠”에 대한 저작권은 제3자에게 있고 “회사”는 그에 대한 사용권을 가집니다.
③ “회원”은 “회사”가 제공하는 “서비스”를 이용함으로써 얻은 정보를 “회사”의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리, 비영리의 목적으로 이용하거나 제 3자에게 이용하게 할 수 없습니다.
④ “회사”는 “회사” 또는 제3자의 저작권을 보호하기 위하여 “회원”이 “서비스”를 이용하는 동안 “회원”의 컴퓨터에 제25조 제1항 제4호의 소프트웨어가 실행되는 것을 감지하여 자동으로 차단하는 프로그램을 사용할 수 있습니다.
⑤ “회원”의 “게시물”에 대한 권리 및 책임은 이를 게시한 “회원”에게 있습니다.
⑥ “회사”는 “회원”이 “웹사이트”에 게시한 수강후기 등의 “게시물”을 사용, 복제, 전송, 수정, 출판, 배포할 수 있다. 단, “회원”의 “게시물”을 마케팅 등에 활용하는 경우 별도의 동의를 받지 않는 한 “회원”의 개인정보를 비식별화 조치하여 활용합니다.

제30조 [손해배상]
회원이 본 약관의 규정을 위반하여 회사 또는 제 3자에게 손해가 발생하게 되는 경우, 약관을 위반한 회원은 회사 및 제 3자에게 발생한 손해를 배상할 책임이 있습니다.

제31조 [면책조항]
① “회사”는 천재지변 또는 이에 준하는 불가항력으로 인하여 “서비스”를 제공할 수 없는 경우에는 “서비스” 제공에 관한 책임이 면제됩니다.
② “회사”는 “회원”의 사유로 인한 “서비스” 이용의 장애에 대하여 책임을 지지 않습니다.
③ “회사”는 “이용자”가 “웹사이트”에 게재한 사실의 신뢰도, 정보나 자료의 정확성 등 내용에 관하여는 책임을 지지 않습니다.
④ “회사”는 “서비스” 이용과 관련하여 “이용자”에게 발생한 손해 가운데 “이용자”의 사유에 의한 손해에 대하여 책임을 지지 않습니다.

제32조 [분쟁의 해결]

① “회사”는 “이용자”가 제기하는 의견이나 불만에 대하여 신속하게 처리하여야 합니다.
② “회사”와 “이용자” 사이에 분쟁이 발생한 경우 “회사” 또는 “이용자”는 콘텐츠분쟁조정위원회에 분쟁조정을 신청할 수 있습니다.

제33조 [학원 강의의 온라인 수강신청 등]
① “회원”의 학원 강의 온라인 수강신청, 결제, 취소, 반 변경, 환불 기타 오프라인 학원 수강과 관련된 사항은 온라인 수강신청 시 제공되는 수강접수 약관 및 관련 법령의 내용에 따릅니다.
② 단기간 강의, 이벤트 강의 등 특별한 학원 강의의 이용 등에 관한 경우에는 수강접수 약관 외에 별도의 규정이 적용될 수 있습니다.

[부칙]
본 약관은 2017년 11월 28일부터 시행됩니다.`}
</Text>);
};

export default Terms01;
export {Terms02, Terms03, Terms04};
